pipex/cc2538/svd/cc2538sf53.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SSI1</name>
      <baseAddress>0x40009000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>CR0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>The CR0 register contains bit fields that control various functions within the SSI module. Functionality such as protocol mode, clock rate, and data size are configured in this register.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Reserved</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>SCR</name>
              <description>[15:8] SSI serial clock rate (R/W)
Reset value: 0x0
The value SCR is used to generate the transmit and receive bit rate of the SSI. Where the bit rate is:
BR = FSSICLK/(CPSDVR * (1 + SCR))
where CPSDVR is an even value from 2-254, programmed in
the SSICPSR register and SCR is a value from 0-255.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SPH</name>
              <description>[7:7] SSI serial clock phase (R/W)
Reset value: 0x0
This bit is only applicable to the Motorola SPI Format.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SPO</name>
              <description>[6:6] SSI serial clock phase (R/W)
Reset value: 0x0
This bit is only applicable to the Motorola SPI Format.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>FRF</name>
              <description>[5:4] SSI frame format select (R/W)
Reset value: 0x0
00: Motorola SPI frame format
01: TI synchronous serial frame format
10: National Microwire frame format
11: Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DSS</name>
              <description>[3:0] SSI data size select (R/W)
Reset value: 0x0
0000-0010: Reserved
0011: 4-bit data
0100: 5-bit data
0101: 6-bit data
0110: 7-bit data
0111: 8-bit data
1000: 9-bit data
1001: 10-bit data
1010: 11-bit data
1011: 12-bit data
1100: 13-bit data
1101: 14-bit data
1110: 15-bit data
1111: 16-bit data</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CR1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>The CR1 register contains bit fields that control various functions within the SSI module. Master and slave mode functionality is controlled by this register.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Reserved</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved16</name>
              <description>[15:4] Reserved, read unpredictable, should be written as 0.
3 SOD</description>
              <bitWidth>12</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SOD</name>
              <description>[3:3] SSI slave mode output disable (R/W)
Reset value: 0x0
This bit is relevant only in the slave mode (MS = 1). In multiple-slave systems, it is possible for the SSI master to broadcast a message to all slaves in the system while ensuring that only one slave drives data onto the serial output line. In such systems, the RXD lines from multiple slaves could be tied together. To operate in such a system, the SOD bit can be set if the SSI slave is not suppose to drive the SSITXD line.
0: SSI can drive SSITXD in slave output mode
1: SSI must not drive the SSITXD output in slave mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MS</name>
              <description>[2:2] SSI master and slave select (R/W)
Reset value: 0x0
This bit can be modified only when the SSI is disabled (SSE = 0).
0: Device configured as a master (default)
1: Device configured as a slave</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SSE</name>
              <description>[1:1] SSI synchronous serial port enable (R/W)
Reset value: 0x0
0: SSI operation is disabled.
1: SSI operation is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>LBM</name>
              <description>[0:0] SSI loop-back mode (R/W)
Reset value: 0x0
0: Normal serial port operation is enabled.
1: The output of the transmit serial shifter is connected to the input of the receive serial shift register internally.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>The DR register is 16 bits wide. When the SSIDR register is read, the entry in the receive FIFO that is pointed to by the current FIFO read pointer is accessed. When a data value is removed by the SSI receive logic from the incoming data frame, it is placed into the entry in the receive FIFO pointed to by the current FIFO write pointer.

