pipex/cc2538/svd/cc2538sf53.svd
        <register>
          <name>CC</name>
          <addressOffset>0xfc8</addressOffset>
          <size>32</size>
          <description>UART clock configuration
The CC register controls the baud and system clocks sources for the UART module. For more information, see the section called "Baud-Rate Generation".
Note: If the PIOSC is used for the UART baud clock, the system clock frequency must be at least 9 MHz in run mode.</description>
          <fields>
            <field>
              <name>Reserved29</name>
              <description>[31:3] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CS</name>
              <description>[2:0] UART baud and system clock source
The following bits determine the clock source that generates the baud and system clocks for the UART.
bit0 (PIOSC): 
       1: The UART baud clock is determined by the IO DIV setting in the system controller.
       0: The UART baud clock is determined by the SYS DIV setting in the system controller.
bit1: Unused
bit2: (DSEN) Only meaningful when the system is in deep sleep mode. This bit is a don't care when not in sleep mode. 
       1: The UART system clock is running on the same clock as the baud clock, as per PIOSC setting above.
       0: The UART system clock is determined by the SYS DIV setting in the system controller.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>I2CM</name>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>SA</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>I2C master slave address
This register consists of eight bits, seven address bits (A6-A0), and a receive and send bit, which determines if the next operation is a receive (high) or transmit (low).</description>
          <fields>
            <field>
              <name>Reserved24</name>
              <description>[31:8] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SA</name>
              <description>[7:1] I2C slave address</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RS</name>
              <description>[0:0] Receive and send
The R/S bit specifies if the next operation is a receive (high) or transmit (low).
0: Transmit
1: Receive</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTRL</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>I2C master control and status
This register accesses status bits when read and control bits when written. When read, the status register indicates the state of the I2C bus controller. When written, the control register configures the I2C controller operation.
The START bit generates the START or REPEATED START condition. The STOP bit determines if the cycle stops at the end of the data cycle or continues on to a repeated START condition. To generate a single transmit cycle, the I2C master slave address (I2CMSA) register is written with the desired address, the R/S bit is cleared, and this register is written with ACK = X (0 or 1), STOP = 1, START = 1, and RUN = 1 to perform the operation and stop. When the operation is completed (or aborted due an error), an interrupt becomes active and the data may be read from the I2CMDR register. When the I2C module operates in master receiver mode, the ACK bit is normally set, causing the I2C bus controller to automatically transmit an acknowledge after each byte. This bit must be cleared when the I2C bus controller requires no further data to be transmitted from the slave transmitter.</description>
          <fields>
            <field>
              <name>Reserved28</name>
              <description>[31:4] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>ACK</name>
              <description>[3:3] Data acknowledge enable
0: The received data byte is not acknowledged automatically by the master.
1: The received data byte is acknowledged automatically by the master.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>STOP</name>
              <description>[2:2] Generate STOP
0: The controller does not generate the STOP condition.
1: The controller generates the STOP condition.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>START</name>
              <description>[1:1] Generate START
0: The controller does not generate the START condition.
1: The controller generates the START condition.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RUN</name>
              <description>[0:0] I2C master enable
0: The master is disabled.
1: The master is enabled to transmit or receive data.
When the BUSY bit is set, the other status bits are not valid.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STAT</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>I2C master control and status
This register accesses status bits when read and control bits when written. When read, the status register indicates the state of the I2C bus controller. When written, the control register configures the I2C controller operation.
The START bit generates the START or REPEATED START condition. The STOP bit determines if the cycle stops at the end of the data cycle or continues on to a repeated START condition. To generate a single transmit cycle, the I2C master slave address (I2CMSA) register is written with the desired address, the R/S bit is cleared, and this register is written with ACK = X (0 or 1), STOP = 1, START = 1, and RUN = 1 to perform the operation and stop. When the operation is completed (or aborted due an error), an interrupt becomes active and the data may be read from the I2CMDR register. When the I2C module operates in master receiver mode, the ACK bit is normally set, causing the I2C bus controller to automatically transmit an acknowledge after each byte. This bit must be cleared when the I2C bus controller requires no further data to be transmitted from the slave transmitter.</description>
          <fields>
            <field>
              <name>Reserved25</name>
              <description>[31:7] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>BUSBSY</name>
              <description>[6:6] Bus busy
0: The I2C bus is idle.
1: The I2C bus is busy.
The bit changes based on the START and STOP conditions.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>IDLE</name>
              <description>[5:5] I2C idle
0: The I2C controller is not idle.
1: The I2C controller is idle.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>ARBLST</name>
              <description>[4:4] Arbitration lost
0: The I2C controller won arbitration.
1: The I2C controller lost arbitration.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DATACK</name>
              <description>[3:3] Acknowledge data
0: The transmited data was acknowledged.
1: The transmited data was not acknowledged.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>ADRACK</name>
              <description>[2:2] Acknowledge address
0: The transmited address was acknowledged.
1: The transmited address was not acknowledged.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ERROR</name>
              <description>[1:1] Error
0: No error was detected on the last operation.
1: An error occurred on the last operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>BUSY</name>
              <description>[0:0] I2C busy
0: The controller is idle.
1: The controller is busy.
When the BUSY bit is set, the other status bits are not valid.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>I2C master data
This register contains the data to be transmitted when in the master transmit state and the data received when in the master receive state.</description>
          <fields>
            <field>
              <name>Reserved24</name>
              <description>[31:8] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DATA</name>
              <description>[7:0] Data transferred
Data transferred during transaction</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TPR</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>I2C master timer period
This register specifies the period of the SCL clock.</description>
          <fields>
            <field>
              <name>Reserved25</name>
              <description>[31:7] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>TPR</name>
              <description>[6:0] SCL clock period
This field specifies the period of the SCL clock.
SCL_PRD = 2 * (1+TPR)*(SCL_LP + SCL_HP)*CLK_PRD
where:
SCL_PRD is the SCL line period (I2C clock).
TPR is the timer period register value (range of 1 to 127)
SCL_LP is the SCL low period (fixed at 6).
SCL_HP is the SCL high period (fixed at 4).
CLK_PRD is the system clock period in ns.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IMR</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>I2C master interrupt mask
This register controls whether a raw interrupt is promoted to a controller interrupt.</description>
          <fields>
            <field>
              <name>Reserved31</name>
              <description>[31:1] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>IM</name>
              <description>[0:0] Interrupt mask
1: The master interrupt is sent to the interrupt controller when the RIS bit in the I2CMRIS register is set.
0: The RIS interrupt is suppressed and not sent to the interrupt controller.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RIS</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>I2C master raw interrupt status
This register specifies whether an interrupt is pending.</description>
          <fields>
            <field>
              <name>Reserved31</name>
              <description>[31:1] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RIS</name>
              <description>[0:0] Raw interrupt status
1: A master interrupt is pending.
0: No interrupt
This bit is cleared by writing 1 to the IC bit in the I2CMICR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MIS</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>I2C master masked interrupt status
This register specifies whether an interrupt was signaled.</description>
          <fields>
            <field>
              <name>Reserved31</name>
              <description>[31:1] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MIS</name>
              <description>[0:0] Masked interrupt status
1: An unmasked master interrupt is pending.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing 1 to the IC bit in the I2CMICR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>I2C master interrupt clear
This register clears the raw and masked interrupts.</description>
          <fields>
            <field>
              <name>Reserved31</name>
              <description>[31:1] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>IC</name>
              <description>[0:0] Interrupt clear
Writing 1 to this bit clears the RIS bit in the I2CMRIS register and the MIS bit in the I2CMMIS register.
Reading this register returns no meaningful data.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CR</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>I2C master configuration
This register configures the mode (master or slave) and sets the interface for test mode loopback.</description>
          <fields>
            <field>
              <name>Reserved26</name>
              <description>[31:6] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SFE</name>
              <description>[5:5] I2C slave function enable
1: Slave mode is enabled.
0: Slave mode is disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MFE</name>
              <description>[4:4] I2C master function enable
1: Master mode is enabled.
0: Master mode is disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[3:1] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>LPBK</name>
              <description>[0:0] I2C loopback
1: The controller in a test mode loopback configuration.
0: Normal operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
