pipex/cc2538/svd/cc2538sf53.svd
        <register>
          <name>IMR</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>GPTM interrupt mask
This register allows software to enable and disable GPTM controller-level interrupts. Setting a bit enables the corresponding interrupt, while clearing a bit disables it.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:12] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TBMIM</name>
              <description>[11:11] GPTM Timer B match interrupt mask
0: Interrupt is disabled.
1: Interrupt is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CBEIM</name>
              <description>[10:10] GPTM Timer B capture event interrupt mask
0: Interrupt is disabled.
1: Interrupt is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CBMIM</name>
              <description>[9:9] GPTM Timer B capture match interrupt mask
0: Interrupt is disabled.
1: Interrupt is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TBTOIM</name>
              <description>[8:8] GPTM Timer B time-out interrupt mask
0: Interrupt is disabled.
1: Interrupt is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:5] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TAMIM</name>
              <description>[4:4] GPTM Timer A match interrupt mask
0: Interrupt is disabled.
1: Interrupt is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[3:3] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CAEIM</name>
              <description>[2:2] GPTM Timer A capture event interrupt mask
0: Interrupt is disabled.
1: Interrupt is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CAMIM</name>
              <description>[1:1] GPTM Timer A capture match interrupt mask
0: Interrupt is disabled.
1: Interrupt is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TATOIM</name>
              <description>[0:0] GPTM Timer A time-out interrupt mask
0: Interrupt is disabled.
1: Interrupt is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RIS</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>GPTM raw interrupt status
This register shows the state of the GPTM internal interrupt signal. These bits are set whether or not the interrupt is masked in the IMR register. Each bit can be cleared by writing 1 to its corresponding bit in ICR.</description>
          <fields>
            <field>
              <name>Reserved16</name>
              <description>[31:12] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TBMRIS</name>
              <description>[11:11] GPTM Timer B match raw interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CBERIS</name>
              <description>[10:10] GPTM Timer B capture event raw interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CBMRIS</name>
              <description>[9:9] GPTM Timer B capture match raw interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TBTORIS</name>
              <description>[8:8] GPTM Timer B time-out raw interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:5] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TAMRIS</name>
              <description>[4:4] GPTM Timer A match raw interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[3:3] Reserved</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CAERIS</name>
              <description>[2:2] GPTM Timer A capture event raw interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CAMRIS</name>
              <description>[1:1] GPTM Timer A capture match raw interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TATORIS</name>
              <description>[0:0] GPTM Timer A time-out raw interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MIS</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>GPTM masked interrupt status
This register shows the state of the GPTM controller-level interrupt. If an interrupt is unmasked in IMR, and there is an event that causes the interrupt to be asserted, the corresponding bit is set in this register. All bits are cleared by writing 1 to the corresponding bit in ICR.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:12] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TBMMIS</name>
              <description>[11:11] GPTM Timer B match masked interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CBEMIS</name>
              <description>[10:10] GPTM Timer B capture event masked interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CBMMIS</name>
              <description>[9:9] GPTM Timer B capture match masked interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TBTOMIS</name>
              <description>[8:8] GPTM Timer B time-out masked interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:5] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TAMRIS</name>
              <description>[4:4] GPTM Timer A match raw interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[3:3] Reserved</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CAEMIS</name>
              <description>[2:2] GPTM Timer A capture event raw interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CAMMIS</name>
              <description>[1:1] GPTM Timer A capture match raw interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TATOMIS</name>
              <description>[0:0] GPTM Timer A time-out raw interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>GPTM interrupt clear
This register is used to clear the status bits in the RIS and MIS registers. Writing 1 to a bit clears the corresponding bit in the RIS and MIS registers.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:17] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>WUECINT</name>
              <description>[16:16] GPTM write update error interrupt clear</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved16</name>
              <description>[15:12] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TBMCINT</name>
              <description>[11:11] GPTM Timer B match interrupt clear</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CBECINT</name>
              <description>[10:10] GPTM Timer B capture event Interrupt clear</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CBMCINT</name>
              <description>[9:9] GPTM Timer B capture match interrupt clear</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TBTOCINT</name>
              <description>[8:8] GPTM Timer B time-out interrupt clear</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:5] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TAMCINT</name>
              <description>[4:4] GPTM Timer A match interrupt clear</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[3:3] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CAECINT</name>
              <description>[2:2] GPTM Timer A capture event Interrupt clear</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CAMCINT</name>
              <description>[1:1] GPTM Timer A capture match interrupt clear</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TATOCINT</name>
              <description>[0:0] GPTM Timer A time-out interrupt clear</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAILR</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>GPTM Timer A interval load
When the Timer is counting down, this register is used to load the starting count value into the Timer. When the Timer is counting up, this register sets the upper bound for the timeout event.
When a GPTM is configured to one of the 32-bit modes, TAILR appears as a 32-bit register (the upper 16-bits correspond to the contents of the GPTM Timer B Interval Load (TBILR) register). In a 16-bit mode, the upper 16 bits of this register read as 0s and have no effect on the state of TBILR.</description>
          <fields>
            <field>
              <name>TAILR</name>
              <description>[31:0] GPTM A interval load register</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBILR</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>GPTM Timer B interval load
When the Timer is counting down, this register is used to load the starting count value into the Timer. When the Timer is counting up, this register sets the upper bound for the time-out event.
When a GPTM is configured to one of the 32-bit modes, the contents of bits [15:0] in this register are loaded into the upper 16 bits of the TAILR register. Reads from this register return the current value of Timer B and writes are ignored. In a 16-bit mode, bits [15:0] are used for the load value. Bits [31:16] are reserved in both cases.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>TBILR</name>
              <description>[15:0] GPTM B interval load register</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAMATCHR</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>GPTM Timer A match
This register is loaded with a match value. Interrupts can be generated when the Timer value is equal to the value in this register in one-shot or periodic mode.
When a GPTM is configured to one of the 32-bit modes, TAMATCHR appears as a 32-bit register (the upper 16-bits correspond to the contents of the GPTM Timer B match (GPTMTBMATCHR) register). In a 16-bit mode, the upper 16 bits of this register read as 0s and have no effect on the state of TBMATCHR.</description>
          <fields>
            <field>
              <name>TAMR</name>
              <description>[31:0] GPTM Timer A match register</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBMATCHR</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>PTM Timer B match
This register is loaded with a match value. Interrupts can be generated when the Timer value is equal to the value in this register in one-shot or periodic mode.
When a GPTM is configured to one of the 32-bit modes, the contents of bits [15:0] in this register are loaded into the upper 16 bits of the TAMATCHR register. Reads from this register return the current match value of Timer B and writes are ignored. In a 16-bit mode, bits [15:0] are used for the match value. Bits [31:16] are reserved in both cases.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>TBMR</name>
              <description>[15:0] GPTM Timer B match register</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAPR</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>GPTM Timer A prescale
This register allows software to extend the range of the 16-bit Timers in periodic and one-shot modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TAPSR</name>
              <description>[7:0] GPTM Timer A prescale</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBPR</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>GPTM Timer B prescale
This register allows software to extend the range of the 16-bit Timers in periodic and one-shot modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TBPSR</name>
              <description>[7:0] GPTM Timer B prescale</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAPMR</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>GPTM Timer A prescale match
This register effectively extends the range of TAMATCHR to 24 bits when operating in 16-bit, one-shot or periodic mode.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TAPSR</name>
              <description>[7:0] GPTM Timer A prescale match</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBPMR</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>GPTM Timer B prescale match
This register effectively extends the range ofMTBMATCHR to 24 bits when operating in 16-bit, one-shot or periodic mode.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TBPSR</name>
              <description>[7:0] GPTM Timer B prescale match</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
