pipex/cc2538/svd/cc2538sf53.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RFCORE_XREG</name>
      <baseAddress>0x40088600</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000200</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>FRMFILT0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>The frame filtering function rejects unintended frames as specified by IEEE 802.15.4, section 7.5.6.2, third filtering
level. In addition, it provides filtering on:
- The eight different frame types (see the FRMFILT1 register)
- The reserved bits in the frame control field (FCF)
The function is controlled by:
- The FRMFILT0 and FRMFILT1 registers
- The PAN_ID, SHORT_ADDR, and EXT_ADDR values in RAM</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>FCF_RESERVED_MASK</name>
              <description>[6:4] Used for filtering on the reserved part of the frame control field (FCF)
FCF_RESERVED_MASK[2:0] is ANDed with FCF[9:7]. If the result is nonzero and frame filtering is enabled, the frame is rejected.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MAX_FRAME_VERSION</name>
              <description>[3:2] Used for filtering on the frame version field of the frame control field (FCF)
If FCF[13:12] (the frame version subfield) is higher than MAX_FRAME_VERSION[1:0] and frame filtering is enabled, the frame is rejected.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PAN_COORDINATOR</name>
              <description>[1:1] Should be set high when the device is a PAN coordinator, to accept frames with no destination address (as specified in Section 7.5.6.2 in IEEE 802.15.4)
0: Device is not a PAN coordinator
1: Device is a PAN coordinator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>FRAME_FILTER_EN</name>
              <description>[0:0] Enables frame filtering
When this bit is set, the radio performs frame filtering as specified in
section 7.5.6.2 of IEEE 802.15.4(b), third filtering level. FRMFILT0[6:1]
and FRMFILT1[7:1], together with the local address information, define
the behavior of the filtering algorithm.
0: Frame filtering off. (FRMFILT0[6:1], FRMFILT1[7:1] and
SRCMATCH[2:0] are don't care.)
1: Frame filtering on.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FRMFILT1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>The frame filtering function rejects unintended frames as specified by IEEE 802.15.4, section 7.5.6.2, third filtering
level. In addition, it provides filtering on:
- The eight different frame types (see the FRMFILT1 register)
- The reserved bits in the frame control field (FCF)
The function is controlled by:
- The FRMFILT0 and FRMFILT1 registers
- The PAN_ID, SHORT_ADDR, and EXT_ADDR values in RAM</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ACCEPT_FT_4TO7_RESERVED</name>
              <description>[7:7] Defines whether reserved frames are accepted or not. Reserved frames have frame type = 100, 101, 110, or 111.
0: Reject
1: Accept</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>ACCEPT_FT_3_MAC_CMD</name>
              <description>[6:6] Defines whether MAC command frames are accepted or not. MAC
command frames have frame type = 011.
0: Reject
1: Accept</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>ACCEPT_FT_2_ACK</name>
              <description>[5:5] Defines whether acknowledgment frames are accepted or not.
Acknowledgement frames have frame type = 010.
0: Reject
1: Accept</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>ACCEPT_FT_1_DATA</name>
              <description>[4:4] Defines whether data frames are accepted or not. Data frames have
frame type = 001.
0: Reject
1: Accept</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>ACCEPT_FT_0_BEACON</name>
              <description>[3:3] Defines whether beacon frames are accepted or not. Beacon frames have frame type = 000.
0: Reject
1: Accept</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MODIFY_FT_FILTER</name>
              <description>[2:1] These bits are used to modify the frame type field of a received frame before frame type filtering is performed. The modification does not influence the frame that is written to the RX FIFO.
00: Leave the frame type as it is.
01: Invert MSB of the frame type.
10: Set MSB of the frame type to 0.
11: Set MSB of the frame type to 1.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>FRM_RESERVED</name>
              <description>[0:0] Reserved. Always write 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCMATCH</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Source address matching and pending bits</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:3] Reserved. Always read 0.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PEND_DATAREQ_ONLY</name>
              <description>[2:2] When this bit is set, the AUTOPEND function also requires that the received frame is a DATA REQUEST MAC command frame.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AUTOPEND</name>
              <description>[1:1] Automatic acknowledgment pending flag enable
When a frame is received, the pending bit in the (possibly) returned acknowledgment is set automatically when the following conditions are met:
- FRMFILT.FRAME_FILTER_EN is set.
- SRCMATCH.SRC_MATCH_EN is set.
- SRCMATCH.AUTOPEND is set.
- The received frame matches the current SRCMATCH.PEND_DATAREQ_ONLY setting.
- The received source address matches at least one source match table entry, which is enabled in SHORT_ADDR_EN and SHORT_PEND_EN or in EXT_ADDR_EN and EXT_PEND_EN.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SRC_MATCH_EN</name>
              <description>[0:0] Source address matching enable (requires that FRMFILT.FRAME_FILTER_EN = 1)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCSHORTEN0</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Short address matching</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SHORT_ADDR_EN</name>
              <description>[7:0] 7:0 part of the 24-bit word SHORT_ADDR_EN that enables or disables source address matching for each of the 24 short address table entries
Optional safety feature: To ensure that an entry in the source matching table is not used while it is being updated, set the corresponding SHORT_ADDR_EN bit to 0 while updating.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCSHORTEN1</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Short address matching</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SHORT_ADDR_EN</name>
              <description>[7:0] 15:8 part of the 24-bit word SHORT_ADDR_EN
See description of SRCSHORTEN0.SHORT_ADDR_EN.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCSHORTEN2</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Short address matching</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SHORT_ADDR_EN</name>
              <description>[7:0] 23:16 part of the 24-bit word SHORT_ADDR_EN
See description of SRCSHORTEN0.SHORT_ADDR_EN.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCEXTEN0</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Extended address matching</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EXT_ADDR_EN</name>
              <description>[7:0] 7:0 part of the 24-bit word EXT_ADDR_EN that enables or disables source address matching for each of the 12 extended address table entries
Write access: Extended address enable for table entry n (0 to 11) is mapped to EXT_ADDR_EN[2n]. All EXT_ADDR_EN[2n + 1] bits are read only.
Read access: Extended address enable for table entry n (0 to 11) is mapped to EXT_ADDR_EN[2n] and EXT_ADDR_EN[2n + 1].
Optional safety feature: To ensure that an entry in the source matching table is not used while it is being updated, set the corresponding EXT_ADDR_EN bit to 0 while updating.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCEXTEN1</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Extended address matching</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EXT_ADDR_EN</name>
              <description>[7:0] 15:8 part of the 24-bit word EXT_ADDR_EN
See description of SRCEXTEN0.EXT_ADDR_EN.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCEXTEN2</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Extended address matching</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EXT_ADDR_EN</name>
              <description>[7:0] 23:16 part of the 24-bit word EXT_ADDR_EN
See description of SRCEXTEN0.EXT_ADDR_EN.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FRMCTRL0</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Frame handling</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>APPEND_DATA_MODE</name>
              <description>[7:7] When AUTOCRC = 0: Don't care
When AUTOCRC = 1:
0: RSSI + The CRC_OK bit and the 7-bit correlation value are
appended at the end of each received frame
1: RSSI + The CRC_OK bit and the 7-bit SRCRESINDEX are
appended at the end of each received frame.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>AUTOCRC</name>
              <description>[6:6] In TX
1: A CRC-16 (ITU-T) is generated in hardware and appended to the
transmitted frame. There is no need to write the last 2 bytes to TXBUF.
0: No CRC-16 is appended to the frame. The last 2 bytes of the frame must be generated manually and written to TXBUF (if not,
TX_UNDERFLOW occurs).
In RX
1: The CRC-16 is checked in hardware, and replaced in the RXFIFO
by a 16-bit status word which contains a CRC OK bit. The status
word is controllable through APPEND_DATA_MODE.
0: The last 2 bytes of the frame (CRC-16 field) are stored in the
RX FIFO. The CRC (if any) must be done manually.
This setting does not influence acknowledgment transmission (including AUTOACK).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>AUTOACK</name>
              <description>[5:5] Defines whether the radio automatically transmits acknowledge frames or not. When autoack is enabled, all frames that are accepted by address filtering, have the acknowledge request flag set, and have a valid CRC are automatically acknowledged 12 symbol periods after being received.
0: Autoack disabled
1: Autoack enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>ENERGY_SCAN</name>
              <description>[4:4] Defines whether the RSSI register contains the most-recent signal
strength or the peak signal strength since the energy scan was enabled.
0: Most-recent signal strength
1: Peak signal strength</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RX_MODE</name>
              <description>[3:2] Set RX modes.
00: Normal operation, use RX FIFO
01: Receive serial mode, output received data on to IOC; infinite RX
10: RX FIFO looping ignore overflow in RX FIFO; infinite reception
11: Same as normal operation except that symbol search is disabled. Can be used for RSSI or CCA measurements when finding symbol is not desired.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TX_MODE</name>
              <description>[1:0] Set test modes for TX.
00: Normal operation, transmit TX FIFO
01: Reserved, should not be used
10: TX FIFO looping ignore underflow in TX FIFO and read cyclic; infinite transmission
11: Send random data from CRC; infinite transmission</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FRMCTRL1</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Frame handling</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:3] Reserved. Read as 0.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PENDING_OR</name>
              <description>[2:2] Defines whether the pending data bit in outgoing acknowledgment frames is always set to 1 or controlled by the main FSM and the address filtering
0: Pending data bit is controlled by main FSM and address filtering.
1: Pending data bit is always 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>IGNORE_TX_UNDERF</name>
              <description>[1:1] Defines whether or not TX underflow should be ignored
0: Normal TX operation. TX underflow is detected and TX is aborted if underflow occurs.
1: Ignore TX underflow. Transmit the number of bytes given by the
frame-length field.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SET_RXENMASK_ON_TX</name>
              <description>[0:0] Defines whether STXON sets bit 6 in the RXENABLE register or leaves it unchanged
0: Does not affect RXENABLE
1: Sets bit 6 in RXENABLE. Used for backward compatibility with the CC2420.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXENABLE</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>RX enabling</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RXENMASK</name>
              <description>[7:0] RXENABLE enables the receiver. A nonzero value in this register causes FFCTRL to enable the receiver when in idle, after transmission and after acknowledgement transmission. 

The following strobes can modify RXENMASK:
SRXON: Set bit 7 in RXENMASK.
STXON: Set bit 6 in RXENMASK if SET_RXENMASK_ON_TX = 1.
SRFOFF: Clears all bits in RXENMASK.
SRXMASKBITSET: Set bit 5 in RXENMASK.
SRXMASKBITCLR: Clear bit 5 in RXENMASK.

There could be conflicts between the CSP and xreg_bus write operations if both operations try to modify RXENMASK simultaneously. To handle the case of simultaneous access to RXENMASK the following rules apply:
- If the two sources agree (they modify different parts of the register) both of their requests to modify RXENMASK are processed.
- If both operations try to modify the mask simultaneously, bus write operations to RXMASKSET and RXMASKCLR have priority over the CSP. This situation must be avoided.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXMASKSET</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>RX enabling</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RXENMASKSET</name>
              <description>[7:0] When written, the written data is ORed with the RXENMASK and stored in RXENMASK.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXMASKCLR</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>RX disabling</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RXENMASKCLR</name>
              <description>[7:0] When written, the written data is inverted and ANDed with the RXENMASK and stored in RXENMASK.
For example, if 1 is written to one or more bit positions in this register, the corresponding bits are cleared in RXENMASK.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
