pipex/cc2538/svd/cc2538sf53.svd
        <register>
          <name>FREQTUNE</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Crystal oscillator frequency tuning</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:4] Reserved. Always read 0.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>XOSC32M_TUNE</name>
              <description>[3:0] Tune crystal oscillator
The default setting 1111 leaves the XOSC untuned. Changing the setting from the default setting (1111) switches in extra capacitance to the oscillator, effectively lowering the XOSC frequency.  Hence, a higher setting gives a higher frequency.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FREQCTRL</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Controls the RF frequency</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>FREQ</name>
              <description>[6:0] Frequency control word
The frequency word in FREQ[6:0] is an offset value from 2394 (fRF = FREQ[6 0] + 2394). The RF-frequency is specified from 2405 to 2480 MHz in 1-MHz steps; hence, the only valid settings for FREQ[6:0] are 11 to 86 (11 + 2394 = 2405 and 86 + 2394 = 2480).  The device supports the frequency range from 2394 to 2507 MHz. Consequently, the usable settings for FREQ[6:0] are 0 to 113. Settings outside of  the usable range (114 to 127) give a frequency of 2507 MHz. 
IEEE 802.15.4-2006 specifies a frequency range from 2405 MHz to 2480 MHz with 16 channels 5 MHz apart. The channels are numbered 11 through 26. For an IEEE 802.15.4-2006 compliant system, the only valid settings are thus
FREQ[6:0] = 11 + 5 (channel number - 11).</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXPOWER</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Controls the output power</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PA_POWER</name>
              <description>[7:4] PA power control</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PA_BIAS</name>
              <description>[3:0] PA bias control</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXCTRL</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Controls the TX settings</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>DAC_CURR</name>
              <description>[6:4] Change the current in the DAC.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DAC_DC</name>
              <description>[3:2] Adjusts the DC level to the TX mixer.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TXMIX_CURRENT</name>
              <description>[1:0] Transmit mixers core current
Current increases with increasing setting.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FSMSTAT0</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Radio status register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CAL_DONE</name>
              <description>[7:7] Frequency synthesis calibration has been performed since the last time the FS was turned on.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>CAL_RUNNING</name>
              <description>[6:6] Frequency synthesis calibration status
0: Calibration is complete or not started.
1: Calibration is in progress.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>FSM_FFCTRL_STATE</name>
              <description>[5:0] Gives the current state of the FIFO and frame control (FFCTRL) finite state-machine.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FSMSTAT1</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>Radio status register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>FIFO</name>
              <description>[7:7] FIFO is high when there is data in the RX FIFO.
FIFO is low during RX FIFO overflow.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>FIFOP</name>
              <description>[6:6] FIFOP is set high when there are at more than FIFOP_THR bytes of data in the RX FIFO that has passed frame filtering.
FIFOP is set high when there is at least one complete frame in the RX FIFO.
FIFOP is high during RX FIFO overflow.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SFD</name>
              <description>[5:5] In TX
0: When a complete frame with SFD was sent or no SFD was sent
1: SFD was sent.
In RX
0: When a complete frame was received or no SFD was received
1: SFD was received.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>CCA</name>
              <description>[4:4] Clear channel assessment
Dependent on CCA_MODE settings. See CCACTRL1 for details.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SAMPLED_CCA</name>
              <description>[3:3] Contains a sampled value of the CCA
The value is updated when a SSAMPLECCA or STXONCCA strobe is issued.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>LOCK_STATUS</name>
              <description>[2:2] 1 when PLL is in lock; otherwise 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TX_ACTIVE</name>
              <description>[1:1] Status signal
Active when FFC is in one of the transmit states</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RX_ACTIVE</name>
              <description>[0:0] Status signal
Active when FFC is in one of the receive states</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FIFOPCTRL</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>FIFOP threshold</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>FIFOP_THR</name>
              <description>[6:0] Threshold used when generating FIFOP signal</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FSMCTRL</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>FSM options</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:2] Reserved. Always read 0.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SLOTTED_ACK</name>
              <description>[1:1] Controls timing of transmission of acknowledge frames
0: The acknowledge frame is sent 12 symbol periods after the end
of the received frame which requests the aknowledge.
1: The acknowledge frame is sent at the first backoff-slot boundary
more than 12 symbol periods after the end of the received frame
which requests the aknowledge.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RX2RX_TIME_OFF</name>
              <description>[0:0] Defines whether or not a 12-symbol time-out should be used after frame
reception has ended.
0: No time-out
1: 12-symbol-period time-out</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CCACTRL0</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>CCA threshold</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CCA_THR</name>
              <description>[7:0] Clear-channel-assessment threshold value, signed 2's-complement
number for comparison with the RSSI.
The unit is 1 dB, offset is 73dB 

