pipex/cc2538/svd/cc2538sf53.svd
The CCA signal goes high when the received signal is below this value. The CCA signal is available on the CCA pin and in the FSMSTAT1 register.
The value must never be set lower than CCA_HYST - 128 to avoid erroneous behavior of the CCA signal.
Note: The reset value translates to an input level of approximately
-32 - 73 = -105 dBm, which is well below the sensitivity limit. This means that the CCA signal never indicates a clear channel.
This register should be updated to 0xF8, which translates to an input
level of about -8 - 73 = -81 dBm.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CCACTRL1</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>Other CCA Options</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:5] Reserved. Always read 0.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>CCA_MODE</name>
              <description>[4:3] 00: CCA always set to 1
01: CCA = 1 when RSSI &lt; CCA_THR - CCA_HYST; CCA = 0 when
RSSI >= CCA_THR
10: CCA = 1 when not receiving a frame, else CCA = 0
11: CCA = 1 when RSSI &lt; CCA_THR - CCA_HYST and not
receiving a frame; CCA = 0 when RSSI >= CCA_THR or when
receiving a frame</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CCA_HYST</name>
              <description>[2:0] Sets the level of CCA hysteresis. Unsigned values given in dB</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RSSI</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>RSSI status register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RSSI_VAL</name>
              <description>[7:0] RSSI estimate on a logarithmic scale, signed number on 2's complement
Unit is 1 dB, offset is 73dB.

The RSSI value is averaged over eight symbol periods. The RSSI_VALID status bit should be checked before reading RSSI_VAL for the first time.
The reset value of -128 also indicates that the RSSI value is invalid.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RSSISTAT</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>RSSI valid status register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:1] Reserved. Always read 0.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RSSI_VALID</name>
              <description>[0:0] RSSI value is valid.
Occurs eight symbol periods after entering RX.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXFIRST</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>First byte in RX FIFO</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DATA</name>
              <description>[7:0] First byte of the RX FIFO
Note: Reading this register does not modify the contents of the FIFO.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXFIFOCNT</name>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <description>Number of bytes in RX FIFO</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RXFIFOCNT</name>
              <description>[7:0] Number of bytes in the RX FIFO (unsigned integer)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXFIFOCNT</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>Number of bytes in TX FIFO</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TXFIFOCNT</name>
              <description>[7:0] Number of bytes in the TX FIFO (unsigned integer)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXFIRST_PTR</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>RX FIFO pointer</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RXFIRST_PTR</name>
              <description>[7:0] RAM address offset of the first byte in the RX FIFO</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXLAST_PTR</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>RX FIFO pointer</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RXLAST_PTR</name>
              <description>[7:0] RAM address offset of the last byte + 1 byte in the RX FIFO</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXP1_PTR</name>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <description>RX FIFO pointer</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RXP1_PTR</name>
              <description>[7:0] RAM address offset of the first byte of the first frame in the RX FIFO</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXFIRST_PTR</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>TX FIFO pointer</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TXFIRST_PTR</name>
              <description>[7:0] RAM address offset of the next byte to be transmitted from the TX FIFO</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXLAST_PTR</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>TX FIFO pointer</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TXLAST_PTR</name>
              <description>[7:0] RAM address offset of the last byte + 1 byte of the TX FIFO</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RFIRQM0</name>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <description>RF interrupt masks</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RFIRQM</name>
              <description>[7:0] Bit mask is masking out interrupt sources.
Bit position:
7: RXMASKZERO
6: RXPKTDONE
5: FRAME_ACCEPTED
4: SRC_MATCH_FOUND
3: SRC_MATCH_DONE
2: FIFOP
1: SFD
0: ACT_UNUSED</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RFIRQM1</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>RF interrupt masks</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:6] 7: Reserved
6: Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RFIRQM</name>
              <description>[5:0] Bit mask is masking out interrupt sources.
Bit position:
5: CSP_WAIT
4: CSP_STOP
3: CSP_MANINT
2: RF_IDLE
1: TXDONE
0: TXACKDONE</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RFERRM</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>RF error interrupt mask</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] 7: Reserved</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RFERRM</name>
              <description>[6:0] Bit mask is masking out interrupt sources.
Bit position:
6: STROBE_ERR
5: TXUNDERF
4: TXOVERF
3: RXUNDERF
2: RXOVERF
1: RXABO
0: NLOCK</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RFRND</name>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <description>Random data</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:2] Reserved. Always read 0.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>QRND</name>
              <description>[1:1] Random bit from the Q channel of the receiver</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>IRND</name>
              <description>[0:0] Random bit from the I channel of the receiver</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MDMCTRL0</name>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <description>Controls modem</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DEM_NUM_ZEROS</name>
              <description>[7:6] Sets how many zero symbols must be detected before the sync word when searching for sync. Only one zero symbol is required to have a correlation value above the correlation threshold set in the MDMCTRL1 register.
00: Reserved
01: 1 zero symbol
10: 2 zero symbols
11: 3 zero symbols</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DEMOD_AVG_MODE</name>
              <description>[5:5] Defines the behavior or the frequency offset averaging filter.
0: Lock average level after preamble match. Restart frequency offset
calibration when searching for the next frame.
1: Continuously update average level.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PREAMBLE_LENGTH</name>
              <description>[4:1] The number of preamble bytes (two zero-symbols) to be sent in TX mode before the SFD, encoded in steps of 2 symbols (1 byte). The reset value of 2 is compliant with IEEE 802.15.4.
0000: 2 leading-zero bytes
0001: 3 leading-zero bytes
0010: 4 leading-zero bytes
...
1111: 17 leading-zero bytes</description>
              <bitWidth>4</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TX_FILTER</name>
              <description>[0:0] Defines the kind of TX filter that is used. The normal TX filter is as defined by the IEEE 802.15.4 standard. Extra filtering may be applied to lower the out-of-band emissions.
0: Normal TX filtering
1: Enable extra filtering</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MDMCTRL1</name>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <description>Controls modem</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:6] Reserved. Always read 0.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>CORR_THR_SFD</name>
              <description>[5:5] Defines requirements for SFD detection:
0: The correlation value of one of the zero symbols of the preamble must be above the correlation threshold.
1: The correlation value of one zero symbol of the preamble and both
symbols in the SFD must be above the correlation threshold.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>CORR_THR</name>
              <description>[4:0] Demodulator correlator threshold value, required before SFD search. Threshold value adjusts how the receiver synchronizes to data from the radio. If the threshold is set too low, sync can more easily be found on noise. If set too high, the sensitivity is reduced, but sync is not likely to be found on noise. In combination with DEM_NUM_ZEROS, the system can be tuned so sensitivity is high with less sync found on noise.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FREQEST</name>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <description>Estimated RF frequency offset</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>FREQEST</name>
              <description>[7:0] Signed 2's-complement value. Contains an estimate of the frequency offset between carrier and the receiver LO. The offset frequency is FREQEST x 7800 Hz. DEM_AVG_MODE controls when this estimate is updated. If DEM_AVG_MODE = 0, it is updated until sync is found. Then the frequency offset estimate is frozen until the end of the received frame. If DEM_AVG_MODE = 1, it is updated as long as the demodulator is enabled. To calculate the correct value, one must use an offset (FREQEST_offset), which can be found in the device data sheet. Real FREQEST value = FREQEST - FREQEST_offset.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXCTRL</name>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <description>Tune receive section</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:6] Reserved. Always read 0.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>GBIAS_LNA2_REF</name>
              <description>[5:4] Adjusts front-end LNA2/mixer PTAT current output (from M = 3 to M = 6), default: M = 5</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>GBIAS_LNA_REF</name>
              <description>[3:2] Adjusts front-end LNA PTAT current output (from M = 3 to M = 6), default: M = 5</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MIX_CURRENT</name>
              <description>[1:0] Control of the output current from the receiver mixers 
The current increases with increasing setting set.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FSCTRL</name>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <description>Tune frequency synthesizer</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PRE_CURRENT</name>
              <description>[7:6] Prescaler current setting</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>LODIV_BUF_CURRENT_TX</name>
              <description>[5:4] Adjusts current in mixer and PA buffers
Used when TX_ACTIVE = 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>LODIV_BUF_CURRENT_RX</name>
              <description>[3:2] Adjusts current in mixer and PA buffers
Used when TX_ACTIVE = 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>LODIV_CURRENT</name>
              <description>[1:0] Adjusts divider currents, except mixer and PA buffers</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
