pipex/cc2538/svd/cc2538sf53.svd
        <register>
          <name>FSCAL0</name>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <description>Tune frequency calibration</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>VCO_CURR_COMP_EN_OV</name>
              <description>[7:7] Force on the current comparator in the VCO. This signal is ORed with the signal coming from the calibration module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>CHP_DISABLE</name>
              <description>[6:6] Set this bit to manually disable charge pump by masking the up and down pulses from the phase detector.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>CHP_CURRENT</name>
              <description>[5:2] Digital bit vector defining the charge-pump output current on an exponential scale

If FFC_BW_BOOST = 0, the read value is the value stored in CHP_CURRENT.
If FFC_BW_BOOST = 1, the read value is CHP_CURRENT + 4.

If the addition causes overflow, the signal is saturated.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>BW_BOOST_MODE</name>
              <description>[1:0] Control signal
Defines the synthesizer boost mode
00: No BW_BOOST
01: BW_BOOST is high during calibration and approximately 30 us into the settling.
10: BW_BOOST is always on (or high).
11: Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FSCAL1</name>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <description>Tune frequency calibration</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>VCO_CURR_CAL_OE</name>
              <description>[7:7] Override current calibration</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>VCO_CURR_CAL</name>
              <description>[6:2] Calibration result
Override value if VCO_CURR_CAL_OE = 1</description>
              <bitWidth>5</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>VCO_CURR</name>
              <description>[1:0] Defines current in VCO core
Sets the multiplier between calibrated current and VCO current.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FSCAL2</name>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <description>Tune frequency calibration</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>VCO_CAPARR_OE</name>
              <description>[6:6] Override the calibration result with the value from VCO_CAPARR[5:0].</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>VCO_CAPARR</name>
              <description>[5:0] VCO capacitor array setting
Programmed during calibration
Override value when VCO_CAPARR_OE = 1</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FSCAL3</name>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <description>Tune frequency calibration</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>VCO_DAC_EN_OV</name>
              <description>[6:6] Enables the VCO DAC when 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>VCO_VC_DAC</name>
              <description>[5:2] Bit vector for programming varactor control voltage from VC DAC</description>
              <bitWidth>4</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>VCO_CAPARR_CAL_CTRL</name>
              <description>[1:0] Calibration accuracy setting for the cap_array calibration part of the calibration
00: 80 XOSC periods
01: 100 XOSC periods 
10: 125 XOSC periods 
11: 250 XOSC periods</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AGCCTRL0</name>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <description>AGC dynamic range control</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>AGC_DR_XTND_EN</name>
              <description>[6:6] 0: The AGC performs no adjustment of attenuation in the AAF.
1: The AGC adjusts the gain in the AAF to achieve extra dynamic range for the receiver.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>AGC_DR_XTND_THR</name>
              <description>[5:0] If the measured error between the AGC reference magnitude and the actual magnitude in dB is larger than this threshold, the extra attenuation is enabled in the front end. This threshold must be set higher than 0x0C.
This feature is enabled by AGC_DR_XTND_EN.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AGCCTRL1</name>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <description>AGC reference level</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:6] Reserved. Always read 0.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>AGC_REF</name>
              <description>[5:0] Target value for the AGC control loop, given in 1-dB steps</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AGCCTRL2</name>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <description>AGC gain override</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>LNA1_CURRENT</name>
              <description>[7:6] Overrride value for LNA 1
Used only when LNA_CURRENT_OE = 1
When read, this register returns the current applied gain setting.
00: 0-dB gain (reference level)
01: 3-dB gain
10: Reserved
11: 6-dB gain</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>LNA2_CURRENT</name>
              <description>[5:3] Overrride value for LNA 2
Used only when LNA_CURRENT_OE = 1
When read, this register returns the current applied gain setting.
000: 0-dB gain (reference level)
001: 3-dB gain
010: 6-dB gain
011: 9-dB gain
100: 12-dB gain
101: 15-dB gain
110: 18-dB gain
111: 21-dB gain</description>
              <bitWidth>3</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>LNA3_CURRENT</name>
              <description>[2:1] Overrride value for LNA 3
Used only when LNA_CURRENT_OE = 1
When read, this register returns the current applied gain setting.
00: 0-dB gain (reference level)
01: 3-dB gain
10: 6-dB gain
11: 9-dB gain</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>LNA_CURRENT_OE</name>
              <description>[0:0] Write 1 to override the AGC LNA current setting with the values above
(LNA1_CURRENT, LNA2_CURRENT, and LNA3_CURRENT).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AGCCTRL3</name>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <description>AGC control</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>AGC_SETTLE_WAIT</name>
              <description>[6:5] Timing for AGC to wait for analog gain to settle after a gain change.
During this period, the energy measurement in the AGC is paused.
00: 15 periods
01: 20 periods
10: 25 periods
11: 30 periods</description>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>AGC_WIN_SIZE</name>
              <description>[4:3] Window size for the accumulate-and-dump function in the AGC.
00: 16 samples
01: 32 samples
10: 64 samples
11: 128 samples</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AAF_RP</name>
              <description>[2:1] Overrides the control signals of the AGC to AAF when AAF_RP_OE = 1.
When read, it returns the applied signal to the AAF.
00: 9-dB attenuation in AAF
01: 6-dB attenuation in AAF
10: 3-dB attenuation in AAF
11: 0-dB attenuation in AAF (reference level)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>AAF_RP_OE</name>
              <description>[0:0] Override the AAF control signals of the AGC with the values stored in AAF_RP.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADCTEST0</name>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <description>ADC tuning</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ADC_VREF_ADJ</name>
              <description>[7:6] Quantizer threshold control for test and debug</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>ADC_QUANT_ADJ</name>
              <description>[5:4] Quantizer threshold control for test and debug</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>ADC_GM_ADJ</name>
              <description>[3:1] Gm-control for test and debug</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ADC_DAC2_EN</name>
              <description>[0:0] Enables DAC2 for enhanced ADC stability</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADCTEST1</name>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <description>ADC tuning</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ADC_TEST_CTRL</name>
              <description>[7:4] ADC test mode selector</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>ADC_C2_ADJ</name>
              <description>[3:2] Used to adjust capacitor values in ADC</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ADC_C3_ADJ</name>
              <description>[1:0] Used to adjust capacitor values in ADC</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADCTEST2</name>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <description>ADC tuning</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>ADC_TEST_MODE</name>
              <description>[6:5] Test mode to enable output of ADC data from demodulator. When enabled, raw ADC data is clocked out on the GPIO pins.
00: Test mode disabled
01: Data from the I and Q ADCs are output (data rate 76 MHz)
10: Data from the I ADC is output. Two and two ADC samples grouped (data rate 38 MHz)
11: Data from the Q ADC is output. Two and two ADC samples grouped (data rate 38 MHz)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>AAF_RS</name>
              <description>[4:3] Controls series resistance of AAF</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>ADC_FF_ADJ</name>
              <description>[2:1] Adjust feed forward</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ADC_DAC_ROT</name>
              <description>[0:0] Control of DAC DWA scheme
0 = DWA (scrambling) disabled
1 = DWA enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MDMTEST0</name>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <description>Test register for modem</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TX_TONE</name>
              <description>[7:4] Enables the possibility to transmit a baseband tone by picking samples from the sine tables with a controllable phase step between the samples.
The step size is controlled by TX_TONE. If MDMTEST1.MOD_IF is 0, the tone is superpositioned on the modulated data, effectively giving modulation with an IF. If MDMTEST1.MOD_IF is 1, only the tone is transmitted.
0000: -6 MHz 
0001: -4 MHz
0010: -3 MHz
0011: -2 MHz
0100: -1 MHz
0101: -500 kHz
0110: -4 kHz
0111: 0
1000: 4 kHz
1001: 500 kHz
1010: 1 MHz
1011: 2 MHz
1100: 3 MHz
1101: 4 MHz
1110: 6 MHz
Others: Reserved</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DC_WIN_SIZE</name>
              <description>[3:2] Controls the numbers of samples to be accumulated between each dump of the accumulate-and-dump filter used in DC removal
00: 32 samples
01: 64 samples
10: 128 samples
11: 256 samples</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DC_BLOCK_MODE</name>
              <description>[1:0] Selects the mode of operation
00: The input signal to the DC blocker is passed to the output without any attempt to remove DC.
01: Enable DC cancellation. Normal operation
10: Freeze estimates of DC when sync is found. Resume estimating DC when searching for the next frame.
11: Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MDMTEST1</name>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <description>Test Register for Modem</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:6] Reserved. Always read 0.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>USEMIRROR_IF</name>
              <description>[5:5] 0: Use the normal IF frequency (MDMTEST0.TX_TONE) for automatic IF compensation of channel frequency on TX.
1: Use mirror IF frequency for automatic compensation of channel frequency on TX.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MOD_IF</name>
              <description>[4:4] 0: Modulation is performed at an IF set by MDMTEST0.TX_TONE. The tone set by MDMTEST0.TX_TONE is superimposed on the data.
1: Modulate a tone set by MDMTEST0.TX_TONE.  A tone is transmitted with frequency set by MDMTEST0.TX_TONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RAMP_AMP</name>
              <description>[3:3] 1: Enable ramping of DAC output amplitude during startup and finish.
0: Disable ramping of DAC output amplitude.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RFC_SNIFF_EN</name>
              <description>[2:2] 0: Packet sniffer module disabled
1: Packet sniffer module enabled. The received and transmitted data can be observed on GPIO pins.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>Reserved</name>
              <description>[1:1] Must be written as 0 for correct operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>LOOPBACK_EN</name>
              <description>[0:0] Enables loopback of modulated data into the receiver chain
0: An STXCAL instruction calibrates for TX. Use STXON to continue to active TX.
1: An STXCAL instruction enables the loopback mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DACTEST0</name>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <description>DAC override value</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DAC_Q_O</name>
              <description>[7:0] Q-branch DAC override value when DAC_SRC = 001

If DAC_SRC is set to be ADC data, CORDIC magnitude, or channel filtered data, then DAC_Q_O controls the part of the word in question that is actually multiplexed to the DAC, as described below.
000111: Bits 7:0
001000: Bits 8:1
001001: Bits 9:2
...

