pipex/cc2538/svd/cc2538sf53.svd
If an invalid setting is chosen, the DAC outputs only zeros (minimum value).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DACTEST1</name>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <description>DAC override value</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DAC_I_O</name>
              <description>[7:0] I-branch DAC override value when DAC_SRC = 001

If DAC_SRC is set  to be ADC data, CORDIC magnitude, channel filtered data, or DC filtered data, then DAC_I_O controls the part of the word in question that is actually multiplexed to the DAC as described below.
000111: Bits 7:0
001000: Bits 8:1
001001: Bits 9:2
...

If an invalid setting is chosen, then the DAC outputs only zeros (minimum value).</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DACTEST2</name>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <description>DAC test setting</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:6] Reserved. Always read 0.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DAC_DEM_EN</name>
              <description>[5:5] Enable and disable dynamic element matching
Drives RFR_DAC_DEM_EN</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DAC_CASC_CTRL</name>
              <description>[4:3] Adjustment of output stage
Drives RFR_DAC_CASC_CTRL</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DAC_SRC</name>
              <description>[2:0] The TX DACs data source is selected by DAC_SRC according to:
000: Normal operation (from modulator)
001: The DAC_I_O and DAC_Q_O override values
010: ADC data after decimation, magnitude controlled by DAC_I_O and DAC_Q_O
011: I/Q after decimation, channel and DC filtering, magnitude controlled by DAC_I_O and DAC_Q_O
100: CORDIC magnitude output and front-end gain is output,  magnitude controlled by DAC_I_O and DAC_Q_O
101: RSSI I output on the I DAC
111: Reserved</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ATEST</name>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <description>Analog test control</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:6] Reserved. Always read 0.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>ATEST_CTRL</name>
              <description>[5:0] Controls the analog test mode:
00 0000: Disabled
00 0001: Enables the temperature sensor (see also the CCTEST_TR0 register description).
Other values reserved.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PTEST0</name>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <description>Override power-down register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PRE_PD</name>
              <description>[7:7] Prescaler power-down signal
When PD_OVERRIDE = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>CHP_PD</name>
              <description>[6:6] Charge pump power-down signal
When PD_OVERRIDE = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>ADC_PD</name>
              <description>[5:5] ADC power-down signal
When PD_OVERRIDE = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DAC_PD</name>
              <description>[4:4] DAC power-down signal
When PD_OVERRIDE = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>LNA_PD</name>
              <description>[3:2] Low-noise amplifier power-down signal
Defines LNA/mixer power-down modes:
00: Power up 
01: LNA off, mixer/regulator on
10: LNA/mixer off, regulator on
11: PD
 When PD_OVERRIDE = 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TXMIX_PD</name>
              <description>[1:1] Transmit mixer power-down signal
When PD_OVERRIDE = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>AAF_PD</name>
              <description>[0:0] Antialiasing filter power-down signal
When PD_OVERRIDE = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PTEST1</name>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <description>Override power-down register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:4] Reserved. Always read 0.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PD_OVERRIDE</name>
              <description>[3:3] Override enabling and disabling of various modules (for debug and testing only)
It is impossible to override hard-coded BIAS_PD[1:0] depenancy.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PA_PD</name>
              <description>[2:2] Power amplifier power-down signal
When PD_OVERRIDE = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>VCO_PD</name>
              <description>[1:1] VCO power-down signal
When PD_OVERRIDE = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>LODIV_PD</name>
              <description>[0:0] LO power-down signal
When PD_OVERRIDE = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_0</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_1</name>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_2</name>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_3</name>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_4</name>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_5</name>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_6</name>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_7</name>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_8</name>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_9</name>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_10</name>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_11</name>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_12</name>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_13</name>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_14</name>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_15</name>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_16</name>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_17</name>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_18</name>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_19</name>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
