pipex/cc2538/svd/cc2538sf53.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RFCORE_SFR</name>
      <baseAddress>0x40088800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>MTCSPCFG</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>MAC Timer event configuration</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>MACTIMER_EVENMT_CFG</name>
              <description>[6:4] Selects the event that triggers an MT_EVENT2 pulse
000: MT_per_event
001: MT_cmp1_event
010: MT_cmp2_event
011: MTovf_per_event
100: MTovf_cmp1_event
101: MTovf_cmp2_event
110: Reserved
111: No event</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[3:3] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MACTIMER_EVENT1_CFG</name>
              <description>[2:0] Selects the event that triggers an MT_EVENT1 pulse
000: MT_per_event
001: MT_cmp1_event
010: MT_cmp2_event
011: MTovf_per_event
100: MTovf_cmp1_event
101: MTovf_cmp2_event
110: Reserved
111: No event</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MTCTRL</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>MAC Timer control register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:4] Reserved. Always read 0.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>LATCH_MODE</name>
              <description>[3:3] 0: Reading MTM0 with MTMSEL.MTMSEL = 000 latches the high byte of the timer, making it ready to be read from MTM1. Reading MTMOVF0 with MTMSEL.MTMOVFSEL = 000 latches the two most-significant bytes of the overflow counter, making it possible to read these from MTMOVF1 and MTMOVF2.
1: Reading MTM0 with MTMSEL.MTMSEL = 000 latches the high byte of the timer and the entire overflow counter at once, making it possible to read the values from MTM1, MTMOVF0, MTMOVF1, and MTMOVF2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>STATE</name>
              <description>[2:2] State of MAC Timer
0: Timer idle
1: Timer running</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SYNC</name>
              <description>[1:1] 0: Starting and stopping of timer is immediate; that is, synchronous with clk_rf_32m.
1: Starting and stopping of timer occurs at the first positive edge of the 32-kHz clock. For more details regarding timer start and stop, see Section 22.4.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RUN</name>
              <description>[0:0] Write 1 to start timer, write 0 to stop timer. When read, it returns the last written value.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MTIRQM</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>MAC Timer interrupt mask</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:6] Reserved. Always read 0.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>MACTIMER_OVF_COMPARE2M</name>
              <description>[5:5] Enables the MACTIMER_OVF_COMPARE2 interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MACTIMER_OVF_COMPARE1M</name>
              <description>[4:4] Enables the MACTIMER_OVF_COMPARE1 interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MACTIMER_OVF_PERM</name>
              <description>[3:3] Enables the MACTIMER_OVF_PER interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MACTIMER_COMPARE2M</name>
              <description>[2:2] Enables the MACTIMER_COMPARE2 interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MACTIMER_COMPARE1M</name>
              <description>[1:1] Enables the MACTIMER_COMPARE1 interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MACTIMER_PERM</name>
              <description>[0:0] Enables the MACTIMER_PER interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MTIRQF</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>MAC Timer interrupt flags</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:6] Reserved. Always read 0.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>MACTIMER_OVF_COMPARE2F</name>
              <description>[5:5] Set when the MAC Timer overflow counter counts to the value set at MTovf_cmp2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MACTIMER_OVF_COMPARE1F</name>
              <description>[4:4] Set when the MAC Timer overflow counter counts to the value set at Timer 2 MTovf_cmp1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MACTIMER_OVF_PERF</name>
              <description>[3:3] Set when the MAC Timer overflow counter would have counted to a value equal to MTovf_per, but instead wraps to 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MACTIMER_COMPARE2F</name>
              <description>[2:2] Set when the MAC Timer counter counts to the value set at MT_cmp2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MACTIMER_COMPARE1F</name>
              <description>[1:1] Set when the MAC Timer counter counts to the value set at MT_cmp1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MACTIMER_PERF</name>
              <description>[0:0] Set when the MAC Timer counter would have counted to a value equal to MT_per, but instead wraps to 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MTMSEL</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>MAC Timer multiplex select</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>MTMOVFSEL</name>
              <description>[6:4] The value of this register selects the internal registers that are modified or read when accessing MTMOVF0, MTMOVF1, and MTMOVF2.
000: MTovf (overflow counter)
001: MTovf_cap (overflow capture)
010: MTovf_per (overflow period)
011: MTovf_cmp1 (overflow compare 1)
100: MTovf_cmp2 (overflow compare 2)
101 to 111: Reserved</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[3:3] Reserved. Read as 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MTMSEL</name>
              <description>[2:0] The value of this register selects the internal registers that are modified or read when accessing MTM0 and MTM1.
000: MTtim (timer count value)
001: MT_cap (timer capture)
010: MT_per (timer period)
011: MT_cmp1 (timer compare 1)
100: MT_cmp2 (timer compare 2)
101 to 111: Reserved
MTM0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MTM0</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>MAC Timer multiplexed register 0</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MTM0</name>
              <description>[7:0] Indirectly returns and modifies bits [7:0] of an internal register depending on the value of MTMSEL.MTMSEL.
When reading the MTM0 register with MTMSEL.MTMSEL set to 000 and MTCTRL.LATCH_MODE set to 0, the timer (MTtim) value is latched.
When reading the MTM0 register with MTMSEL.MTMSEL set to 000 and MTCTRL.LATCH_MODE set to 1, the timer (MTtim) and overflow counter (MTovf) values are latched.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MTM1</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>MAC Timer multiplexed register 1</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MTM1</name>
              <description>[7:0] Indirectly returns and modifies bits [15:8] of an internal register, depending on the value of MTMSEL.MTMSEL.
When reading the MTM0 register with MTMSEL.MTMSEL set to 000, the timer (MTtim) value is latched.
Reading this register with MTMSEL.MTMSEL set to 000 returns the latched value of MTtim[15:8].</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MTMOVF2</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>MAC Timer multiplexed overflow register 2</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MTMOVF2</name>
              <description>[7:0] Indirectly returns and modifies bits [23:16] of an internal register, depending on the value of MTMSEL.MTMOVFSEL.
Reading this register with MTMSEL.MTMOVFSEL set to 000 returns the latched value of MTovf[23:16].</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MTMOVF1</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>MAC Timer multiplexed overflow register 1</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MTMOVF1</name>
              <description>[7:0] Indirectly returns and modifies bits [15:8] of an internal register, depending on the value of MTMSEL.MTMSEL.
Reading this register with MTMSEL.MTMOVFSEL set to 000 returns the latched value of MTovf[15:8].</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MTMOVF0</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>MAC Timer multiplexed overflow register 0</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MTMOVF0</name>
              <description>[7:0] Indirectly returns and modifies bits [7:0] of an internal register, depending on the value of MTMSEL.MTMOVFSEL.
When reading the MTMOVF0 register with MTMSEL.MTMOVFSEL set to 000 and MTCTRL.LATCH_MODE set to 0, the overflow counter value (MTovf) is latched.
When reading the MTM0 register with MTMSEL.MTMOVFSEL set to 000 and MTCTRL.LATCH_MODE set to 1, the overflow counter value (MTovf) is latched.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RFDATA</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>The TX FIFO and RX FIFO may be accessed through this register. Data is written to the TX FIFO when writing to the RFD register. Data is read from the RX FIFO when the RFD register is read. The XREG registers RXFIFOCNT and TXFIFOCNT provide information on the amount of data in the FIFOs. The FIFO contents can be cleared by issuing SFLUSHRX and SFLUSHTX.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RFD</name>
              <description>[7:0] Data written to the register is written to the TX FIFO. When reading this register, data from the RX FIFO is read.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RFERRF</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>RF error interrupt flags</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved</name>
              <description>[7:7] Reserved. Read as 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>STROBEERR</name>
              <description>[6:6] A command strobe was issued when it could not be processed.
Triggered if trying to disable the radio when it is already disabled, or when trying to do a SACK, SACKPEND, or SNACK command when not in active RX.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>TXUNDERF</name>
              <description>[5:5] TX FIFO underflowed.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TXOVERF</name>
              <description>[4:4] TX FIFO overflowed.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RXUNDERF</name>
              <description>[3:3] RX FIFO underflowed.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RXOVERF</name>
              <description>[2:2] RX FIFO overflowed.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RXABO</name>
              <description>[1:1] Reception of a frame was aborted.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>NLOCK</name>
              <description>[0:0] The frequency synthesizer failed to achieve lock after time-out, or lock is lost during reception. The receiver must be restarted to clear this error situation.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RFIRQF1</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>RF interrupt flags</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved</name>
              <description>[7:6] Reserved. Read as 0.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>CSP_WAIT</name>
              <description>[5:5] Execution continued after a wait instruction in CSP.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>CSP_STOP</name>
              <description>[4:4] CSP has stopped program execution.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CSP_MANINT</name>
              <description>[3:3] Manual interrupt generated from CSP
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RFIDLE</name>
              <description>[2:2] Radio state-machine has entered the IDLE state.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TXDONE</name>
              <description>[1:1] A complete frame has been transmitted.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TXACKDONE</name>
              <description>[0:0] An acknowledgement frame has been completely transmitted.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
