pipex/cc2538/svd/cc2538sf53.svd
        <register>
          <name>CTRL</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>USB peripheral control register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PLLLOCKED</name>
              <description>[7:7] PLL lock status. The PLL is locked when USB_CTRL.PLLLOCKED is 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>Reserved7</name>
              <description>[6:3] Reserved</description>
              <bitWidth>4</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[2:2] Reserved.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PLLEN</name>
              <description>[1:1] 48 MHz USB PLL enable
When this bit is set, the 48 MHz PLL is started. Software must avoid access to other USB registers before the PLL has locked; that is, USB_CTRL.PLLLOCKED is 1. This bit can be set only when USB_CTRL.USBEN is 1.
The PLL must be disabled before entering PM1 when suspended, and must be re-enabled when resuming operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>USBEN</name>
              <description>[0:0] USB enable
The USB controller is reset when this bit is cleared</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MAXI</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Indexed register:
For USB_INDEX = 1-5: Maximum packet size for IN endpoint {1-5}</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>USBMAXI</name>
              <description>[7:0] Maximum packet size, in units of 8 bytes, for the selected IN endpoint
The value of this register should match the wMaxPacketSize field in the standard endpoint descriptor for the endpoint. The value must not exceed the available memory.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CS0_CSIL</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Indexed register:
For USB_INDEX = 0: Endpoint 0 control and status
For USB_INDEX = 1-5: IN endpoint {1-5} control and status (low byte)</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CLRSETUPEND_or_Reserved8</name>
              <description>[7:7] USB_CS0.CLRSETUPEND [RW]:
Software sets this bit to clear the USB_CS0.SETUPEND bit. It is cleared automatically.

USB_CSIL.Reserved [RO]:
Reserved</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>CLROUTPKTRDY_or_CLRDATATOG</name>
              <description>[6:6] USB_CS0.CLROUTPKTRDY [RW]:
Software sets this bit to clear the USB_CS0.OUTPKTRDY bit. It is cleared automatically.

USB_CSIL.CLRDATATOG [RW]:
Software sets this bit to reset the IN endpoint data toggle to 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SENDSTALL_or_SENTSTALL</name>
              <description>[5:5] USB_CS0.SENDSTALL [RW]:
Software sets this bit to terminate the current transaction with a STALL handshake. The bit is cleared automatically when the STALL handshake has been transmitted.

USB_CSIL.SENTSTALL [RW]:
For bulk/interrupt mode IN endpoints:
This bit is set when a STALL handshake is transmitted. The FIFO is flushed and the USB_CSIL.INPKTRDY bit cleared. Software should clear this bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>SETUPEND_or_SENDSTALL</name>
              <description>[4:4] USB_CS0.SETUPEND [RO]:
This bit is set when a control transaction ends before the USB_CS0.DATAEND bit has been set. An interrupt is generated and the FIFO flushed at this time. Software clears this bit by setting USB_CS0.CLRSETUPEND.

CSIL.SENDSTALL [RW]:
For bulk/interrupt mode IN endpoints: 
Software sets this bit to issue a STALL handshake. 
Software clears this bit to terminate the stall condition.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DATAEND_or_FLUSHPACKET</name>
              <description>[3:3] USB_CS0.DATAEND [RW]:
This bit is used to signal the end of the data stage, and must be set:
1. When the last data packet is loaded and USB_CS0.INPKTRDY is set.
2. When the last data packet is unloaded and USB_CS0.CLROUTPKTRDY is set.
3. When USB_CS0.INPKTRDY is set to send a zero-length packet.
The USB controller clears this bit automatically.

USB_CSIL.FLUSHPACKET [RW]:
Software sets this bit to flush the next packet to be transmitted from the IN endpoint FIFO. The FIFO pointer is reset and the USB_CSIL.INPKTRDY bit is cleared. 
Note: If the FIFO contains two packets, USB_CSIL.FLUSHPACKET will need to be set twice to completely clear the FIFO.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SENTSTALL_or_UNDERRUN</name>
              <description>[2:2] USB_CS0.SENTSTALL [RW]: 
This bit is set when a STALL handshake is sent. An interrupt is generated is generated when this bit is set. Software must clear this bit.

USB_CSIL.UNDERRUN [RW]: 
In isochronous mode, this bit is set when a zero length data packet is sent after receiving an IN token with USB_CSIL.INPKTRDY not set. 
In bulk/interrupt mode, this bit is set when a NAK is returned in
response to an IN token. Software should clear this bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>INPKTRDY_or_PKTPRESENT</name>
              <description>[1:1] USB_CS0. INPKTRDY [RW]: 
Software sets this bit after loading a data packet into the endpoint 0 FIFO. It is cleared automatically when the data packet has been transmitted. An interrupt is generated when the bit is cleared.

USB_CSIL.PKTPRESENT [RO]:
This bit is set when there is at least one packet in the IN endpoint FIFO.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>OUTPKTRDY_or_INPKTRDY</name>
              <description>[0:0] USB_CS0.OUTPKTRDY [RO]:
Endpoint 0 data packet received
An interrupt request (EP0) is generated if the interrupt is enabled. Software must read the endpoint 0 FIFO empty, and clear this bit by setting USB_CS0.CLROUTPKTRDY

USB_CSIL.INPKTRDY [RW]:
IN endpoint {1-5} packet transfer pending
Software sets this bit after loading a data packet into the FIFO. It is cleared automatically when a data packet has been transmitted. An interrupt is generated (if enabled) when the bit is cleared.
When using double-buffering, the bit is cleared immediately if the other FIFO is empty.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSIH</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Indexed register:
For USB_INDEX = 1-5: IN endpoint {1-5} control and status (high byte)</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AUTISET</name>
              <description>[7:7] If set by software, the USB_CSIL.INPKTRDY bit is automatically set when a data packet of maximum size (specified by USBMAXI) is loaded into the IN endpoint FIFO. If a packet of less than the maximum packet size is loaded, then USB_CSIL.INPKTRDY will have to be set manually.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>ISO</name>
              <description>[6:6] Selects IN endpoint type:
0: Bulk/interrupt
1: Isochronous</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>Reserved5</name>
              <description>[5:5] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>Reserved4</name>
              <description>[4:4] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>FORCEDATATOG</name>
              <description>[3:3] Software sets this bit to force the IN endpoint's data toggle to switch after each data packet is sent regardless of whether an ACK was received. This can be used by interrupt IN endpoints which are
used to communicate rate feedback for isochronous endpoints.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[2:1] Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>INDBLBUF</name>
              <description>[0:0] IN endpoint FIFO double-buffering enable:
0: Double buffering disabled
1: Double buffering enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MAXO</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>Indexed register:
For USB_INDEX = 1-5: Maximum packet size for OUT endpoint {1-5}</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>USBMAXO</name>
              <description>[7:0] Maximum packet size, in units of 8 bytes, for the selected OUT endpoint
The value of this register should match the wMaxPacketSize field in the standard endpoint descriptor for the endpoint. The value must not exceed the available memory.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSOL</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>Indexed register:
For USB_INDEX = 1-5: OUT endpoint {1-5} control and status (low byte)</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CLRDATATOG</name>
              <description>[7:7] Software sets this bit to reset the endpoint data toggle to 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SENTSTALL</name>
              <description>[6:6] This bit is set when a STALL handshake is transmitted. An interrupt is generated when this bit is set. Software should clear this bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SENDSTALL</name>
              <description>[5:5] For bulk/interrupt mode OUT endpoints:
Software sets this bit to issue a STALL handshake. 
Software clears this bit to terminate the stall condition.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>FLUSHPACKET</name>
              <description>[4:4] Software sets this bit to flush the next packet to be read from the endpoint OUT FIFO.
Note: If the FIFO contains two packets, USB_CSOL.FLUSHPACKET will need to be set twice to completely clear the FIFO.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DATAERROR</name>
              <description>[3:3] For isochronous mode OUT endpoints:
This bit is set when USB_CSOL.OUTPKTRDY is set if the data packet has a CRC or bit-stuff error. It is cleared automatically when USB_CSOL.OUTPKTRDY is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>[2:2] For isochronous mode OUT endpoints:
This bit is set when an OUT packet cannot be loaded into the OUT endpoint FIFO. Firmware should clear this bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>FIFOFULL</name>
              <description>[1:1] This bit is set when no more packets can be loaded into the OUT endpoint FIFO.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>OUTPKTRDY</name>
              <description>[0:0] This bit is set when a data packet has been received. Software should clear this bit when the packet has been unloaded from the OUT endpoint FIFO. An interrupt is generated when the bit is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSOH</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>Indexed register:
For USB_INDEX = 1-5: OUT endpoint {1-5} control and status (high byte)</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AUTOCLEAR</name>
              <description>[7:7] If software sets this bit, the USB_CSOL.OUTPKTRDY bit will be automatically cleared when a packet of maximum size (specified by USB_MAXO) has been unloaded from the OUT FIFO. When packets of less than the maximum packet size are unloaded, USB_CSOL.OUTPKTRDY will have to be cleared manually.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>ISO</name>
              <description>[6:6] Selects OUT endpoint type:
0: Bulk/interrupt
1: Isochronous</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>Reserved5</name>
              <description>[5:5] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>Reserved4</name>
              <description>[4:4] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>Reserved1</name>
              <description>[3:1] Reserved</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>OUTDBLBUF</name>
              <description>[0:0] OUT endpoint FIFO double-buffering enable:
0: Double buffering disabled
1: Double buffering enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CNT0_CNTL</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>Indexed register:
For USB_INDEX = 0: Number of received bytes in the endpoint 0 FIFO 
For USB_INDEX = 1-5: Number of received bytes in the OUT endpoint {1-5} FIFO (low byte)</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>FIFOCNT_or_FIFOCNTL</name>
              <description>[7:0] USB_CS0.FIFOCNT (USBINDEX = 0) [RO]:
Number of bytes received in the packet in the endpoint 0 FIFO
Valid only when USB_CS0.OUTPKTRDY is set

USB_CSIL.FIFOCNTL (USBINDEX = 1 to 5) [RW]:
Bits 7:0 of the of the number of bytes received in the packet in the OUT endpoint {1-5} FIFO
Valid only when USB_CSOL.OUTPKTRDY is set</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CNTH</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>Indexed register:
For USB_INDEX = 1-5: Number of received in the OUT endpoint {1-5} FIFO (high byte)</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:3] Reserved</description>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>FIFOCNTH</name>
              <description>[2:0] Bits 10:8 of the of the number of bytes received in the packet in the OUT endpoint {1-5} FIFO
Valid only when USB_CSOL.OUTPKTRDY is set</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>F0</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>Endpoint 0 FIFO</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>USBF0</name>
              <description>[7:0] Endpoint 0 FIFO
Reading this register unloads one byte from the endpoint 0 FIFO.
Writing to this register loads one byte into the endpoint 0 FIFO.
The FIFO memory for EP0 is used for incoming and outgoing data packets.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>F1</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>IN/OUT endpoint 1 FIFO</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>USBF1</name>
              <description>[7:0] Endpoint 1 FIFO register
Reading this register unloads one byte from the EP1 OUT FIFO. Writing to this register loads one byte into the EP1 IN FIFO.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>F2</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>IN/OUT endpoint 2 FIFO</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>USBF2</name>
              <description>[7:0] Endpoint 2 FIFO register
Reading this register unloads one byte from the EP2 OUT FIFO. Writing to this register loads one byte into the EP2 IN FIFO.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
