pipex/cc2538/svd/cc2538sf53.svd
        <register>
          <name>F3</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>IN/OUT endpoint 3 FIFO</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>USBF3</name>
              <description>[7:0] Endpoint 3 FIFO register
Reading this register unloads one byte from the EP3 OUT FIFO. Writing to this register loads one byte into the EP3 IN FIFO.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>F4</name>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <description>IN/OUT endpoint 4 FIFO</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>USBF4</name>
              <description>[7:0] Endpoint 4 FIFO register
Reading this register unloads one byte from the EP4 OUT FIFO. Writing to this register loads one byte into the EP4 IN FIFO.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>F5</name>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <description>IN/OUT endpoint 5 FIFO</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>USBF5</name>
              <description>[7:0] Endpoint 5 FIFO register
Reading this register unloads one byte from the EP5 OUT FIFO. Writing to this register loads one byte into the EP5 IN FIFO.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AES</name>
      <baseAddress>0x4008B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>DMAC_CH0_CTRL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Channel control
This register is used for channel enabling and priority selection. When a channel is disabled, it becomes inactive only when all ongoing requests are finished.</description>
          <fields>
            <field>
              <name>Reserved30</name>
              <description>[31:2] Should be written with 0s and ignored on read</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PRIO</name>
              <description>[1:1] Channel priority
0: Low
1: High
If both channels have the same priority, access of the channels to the external port is arbitrated using the round robin scheme. If one channel has a high priority and another one low, the channel with the high priority is served first, in case of simultaneous access requests.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Channel enable
0: Disabled
1: Enable
Note: Disabling an active channel interrupts the DMA operation. The ongoing block transfer completes, but no new transfers are requested.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMAC_CH0_EXTADDR</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Channel external address</description>
          <fields>
            <field>
              <name>ADDR</name>
              <description>[31:0] Channel external address value
When read during operation, it holds the last updated external address after being sent to the master interface.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMAC_CH0_DMALENGTH</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Channel DMA length</description>
          <fields>
            <field>
              <name>Reserved16</name>
              <description>[31:16] Should be written with 0s and ignored on read</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DMALEN</name>
              <description>[15:0] Channel DMA length in bytes
During configuration, this register contains the DMA transfer length in bytes. During operation, it contains the last updated value of the DMA transfer length after being sent to the master interface.
Note: Setting this register to a nonzero value starts the transfer if the channel is enabled. Therefore, this register must be written last when setting up a DMA channel.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMAC_STATUS</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>DMAC status
This register provides the actual state of each DMA channel. It also reports port errors in case these were received by the master interface module during the data transfer.</description>
          <fields>
            <field>
              <name>Reserved14</name>
              <description>[31:18] Bits should be ignored on read.</description>
              <bitWidth>14</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>PORT_ERR</name>
              <description>[17:17] Reflects possible transfer errors on the AHB port.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>Reserved15</name>
              <description>[16:2] Bits should be ignored on read.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CH1_ACT</name>
              <description>[1:1] A value of 1 indicates that channel 1 is active (DMA transfer on-going).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CH0_ACT</name>
              <description>[0:0] A value of 1 indicates that channel 0 is active (DMA transfer on-going).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMAC_SWRES</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>DMAC software reset register
Software reset is used to reset the DMAC to stop all transfers and clears the port error status register. After the software reset is performed, all the channels are disabled and no new requests are performed by the channels. The DMAC waits for the existing (active) requests to finish and accordingly sets the DMAC status registers.</description>
          <fields>
            <field>
              <name>Reserved31</name>
              <description>[31:1] Bits should be written with a value of 0.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SWRES</name>
              <description>[0:0] Software reset enable
0 = Disabled
1 = Enabled (self-cleared to 0)
Completion of the software reset must be checked through the DMAC_STATUS register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMAC_CH1_CTRL</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Channel control
This register is used for channel enabling and priority selection. When a channel is disabled, it becomes inactive only when all ongoing requests are finished.</description>
          <fields>
            <field>
              <name>Reserved30</name>
              <description>[31:2] Should be written with 0s and ignored on read</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PRIO</name>
              <description>[1:1] Channel priority
0: Low
1: High
If both channels have the same priority, access of the channels to the external port is arbitrated using the round robin scheme. If one channel has a high priority and another one low, the channel with the high priority is served first, in case of simultaneous access requests.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Channel enable
0: Disabled
1: Enable
Note: Disabling an active channel interrupts the DMA operation. The ongoing block transfer completes, but no new transfers are requested.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMAC_CH1_EXTADDR</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Channel external address</description>
          <fields>
            <field>
              <name>ADDR</name>
              <description>[31:0] Channel external address value.
When read during operation, it holds the last updated external address after being sent to the master interface.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMAC_CH1_DMALENGTH</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Channel DMA length</description>
          <fields>
            <field>
              <name>Reserved16</name>
              <description>[31:16] Should be written with 0s and ignored on read</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DMALEN</name>
              <description>[15:0] Channel DMA length in bytes.
During configuration, this register contains the DMA transfer length in bytes. During operation, it contains the last updated value of the DMA transfer length after being sent to the master interface.
Note: Setting this register to a nonzero value starts the transfer if the channel is enabled. Therefore, this register must be written last when setting up a DMA channel.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMAC_MST_RUNPARAMS</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>DMAC master run-time parameters
This register defines all the run-time parameters for the AHB master interface port. These parameters are required for the proper functioning of the EIP-101m AHB master adapter.</description>
          <fields>
            <field>
              <name>Reserved16</name>
              <description>[31:16] Should be written with 0s and ignored on read</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>AHB_MST1_BURST_SIZE</name>
              <description>[15:12] Maximum burst size that can be performed on the AHB bus
0010b = 4 bytes (default)
0011b = 8 bytes
0100b = 16 bytes
0101b = 32 bytes
0110b = 64 bytes
Others = Reserved</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>AHB_MST1_IDLE_EN</name>
              <description>[11:11] Idle insertion between consecutive burst transfers on AHB
0: No Idle insertion
1: Idle insertion</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>AHB_MST1_INCR_EN</name>
              <description>[10:10] Burst length type of AHB transfer
0: Unspecified length burst transfers
1: Fixed length burst or single transfers</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>AHB_MST1_LOCK_EN</name>
              <description>[9:9] Locked transform on AHB
0: Transfers are not locked
1: Transfers are locked</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>AHB_MST1_BIGEND</name>
              <description>[8:8] Endianess for the AHB master
0: Little endian
1: Big endian</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:0] Should be written with 0s and ignored on read</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMAC_PERSR</name>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <description>DMAC port error raw status register
This register provides the actual status of individual port errors. It also indicates which channel is serviced by an external AHB port (which is frozen by a port error). A port error aborts operations on all serviced channels (channel enable bit is forced to 0) and prevents further transfers via that port until the error is cleared by writing to the DMAC_SWRES register.</description>
          <fields>
            <field>
              <name>Reserved19</name>
              <description>[31:13] Bits should be ignored on read</description>
              <bitWidth>19</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PORT1_AHB_ERROR</name>
              <description>[12:12] A value of 1 indicates that the EIP-101 has detected an AHB bus error</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[11:10] Bits should be ignored on read</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PORT1_CHANNEL</name>
              <description>[9:9] Indicates which channel has serviced last (channel 0 or channel 1) by AHB master port.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>Reserved9</name>
              <description>[8:0] Bits should be ignored on read</description>
              <bitWidth>9</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMAC_OPTIONS</name>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <description>DMAC options register
These registers contain information regarding the different options configured in this DMAC.</description>
          <fields>
            <field>
              <name>Reserved20</name>
              <description>[31:12] Bits should be ignored on read</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>NR_OF_CHANNELS</name>
              <description>[11:8] Number of channels implemented, value in the range 1-8.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved5</name>
              <description>[7:3] Bits should be ignored on read</description>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>NR_OF_PORTS</name>
              <description>[2:0] Number of ports implemented, value in range 1-4.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMAC_VERSION</name>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <description>DMAC version register
This register contains an indication (or signature) of the EIP type of this DMAC, as well as the hardware version/patch numbers.</description>
          <fields>
            <field>
              <name>Reserved4</name>
              <description>[31:28] Bits should be ignored on read</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>HW_MAJOR_VERSION</name>
              <description>[27:24] Major version number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>HW_MINOR_VERSION</name>
              <description>[23:20] Minor version number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>HW_PATCH_LEVEL</name>
              <description>[19:16] Patch level
Starts at 0 at first delivery of this version</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>EIP_NUMBER_COMPL</name>
              <description>[15:8] Bit-by-bit complement of the EIP_NUMBER field bits.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EIP_NUMBER</name>
              <description>[7:0] Binary encoding of the EIP-number of this DMA controller (209)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
