pipex/cc2538/svd/cc2538sf53.svd
        <register>
          <name>KEY_STORE_WRITE_AREA</name>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <description>Key store write area register
This register defines where the keys should be written in the key store RAM. After writing this register, the key store module is ready to receive the keys through a DMA operation. In case the key data transfer triggered an error in the key store, the error will be available in the interrupt status register after the DMA is finished. The key store write-error is asserted when the programmed/selected area is not completely written. This error is also asserted when the DMA operation writes to ram areas that are not selected.
The key store RAM is divided into 8 areas of 128 bits.
192-bit keys written in the key store RAM should start on boundaries of 256 bits. This means that writing a 192-bit key to the key store RAM must be done by writing 256 bits of data with the 64 most-significant bits set to 0. These bits are ignored by the AES engine.</description>
          <fields>
            <field>
              <name>Reserved1</name>
              <description>[31:8] Write 0s and ignore on reading</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RAM_AREA7</name>
              <description>[7:7] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA7 is not selected to be written.
1: RAM_AREA7 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RAM_AREA6</name>
              <description>[6:6] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA6 is not selected to be written.
1: RAM_AREA6 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RAM_AREA5</name>
              <description>[5:5] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA5 is not selected to be written.
1: RAM_AREA5 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RAM_AREA4</name>
              <description>[4:4] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA4 is not selected to be written.
1: RAM_AREA4 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RAM_AREA3</name>
              <description>[3:3] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA3 is not selected to be written.
1: RAM_AREA3 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RAM_AREA2</name>
              <description>[2:2] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA2 is not selected to be written.
1: RAM_AREA2 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RAM_AREA1</name>
              <description>[1:1] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA1 is not selected to be written.
1: RAM_AREA1 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RAM_AREA0</name>
              <description>[0:0] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA0 is not selected to be written.
1: RAM_AREA0 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY_STORE_WRITTEN_AREA</name>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <description>Key store written area register
This register shows which areas of the key store RAM contain valid written keys.
When a new key needs to be written to the key store, on a location that is already occupied by a valid key, this key area must be cleared first. This can be done by writing this register before the new key is written to the key store memory.
Attempting to write to a key area that already contains a valid key is not allowed and results in an error.</description>
          <fields>
            <field>
              <name>Reserved1</name>
              <description>[31:8] Write 0s and ignore on reading</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN7</name>
              <description>[7:7] Read operation:
0: This RAM area is not written with valid key information.
1: This RAM area is written with valid key information.

Each individual ram_area_writtenx bit can be reset by writing 1.

Note: This register is reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN6</name>
              <description>[6:6] Read operation:
0: This RAM area is not written with valid key information.
1: This RAM area is written with valid key information.

Each individual ram_area_writtenx bit can be reset by writing 1.

Note: This register is reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN5</name>
              <description>[5:5] Read operation:
0: This RAM area is not written with valid key information.
1: This RAM area is written with valid key information.

Each individual ram_area_writtenx bit can be reset by writing 1.

Note: This register is reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN4</name>
              <description>[4:4] Read operation:
0: This RAM area is not written with valid key information.
1: This RAM area is written with valid key information.

Each individual ram_area_writtenx bit can be reset by writing 1.

Note: This register is reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN3</name>
              <description>[3:3] Read operation:
0: This RAM area is not written with valid key information.
1: This RAM area is written with valid key information.

Each individual ram_area_writtenx bit can be reset by writing 1.

Note: This register is reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN2</name>
              <description>[2:2] Read operation:
0: This RAM area is not written with valid key information.
1: This RAM area is written with valid key information.

Each individual ram_area_writtenx bit can be reset by writing 1.

Note: This register is reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN1</name>
              <description>[1:1] Read operation:
0: This RAM area is not written with valid key information.
1: This RAM area is written with valid key information.

Each individual ram_area_writtenx bit can be reset by writing 1.

Note: This register is reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN0</name>
              <description>[0:0] Read operation:
0: This RAM area is not written with valid key information.
1: This RAM area is written with valid key information.

Each individual ram_area_writtenx bit can be reset by writing 1.

Note: This register is reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY_STORE_SIZE</name>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <description>Key store size register
This register defines the size of the keys that are written with DMA. This register should be configured before writing to the KEY_STORE_WRITE_AREA register.</description>
          <fields>
            <field>
              <name>Reserved1</name>
              <description>[31:2] Write 0s and ignore on reading</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>KEY_SIZE</name>
              <description>[1:0] Key size:
00: Reserved
01: 128 bits
10: 192 bits
11: 256 bits
When writing this to this register, the KEY_STORE_WRITTEN_AREA register is reset.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY_STORE_READ_AREA</name>
          <addressOffset>0x40c</addressOffset>
          <size>32</size>
          <description>Key store read area register
This register selects the key store RAM area from where the key needs to be read that will be used for an AES operation. The operation directly starts after writing this register. When the operation is finished, the status of the key store read operation is available in the interrupt status register. Key store read error is asserted when a RAM area is selected which does not contain valid written key.</description>
          <fields>
            <field>
              <name>BUSY</name>
              <description>[31:31] Key store operation busy status flag (read only):
0: Operation is complete.
1: Operation is not completed and the key store is busy.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>Reserved1</name>
              <description>[30:4] Write 0s and ignore on reading</description>
              <bitWidth>27</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RAM_AREA</name>
              <description>[3:0] Selects the area of the key store RAM from where the key needs to be read that will be writen to the AES engine
RAM_AREA:
0000: RAM_AREA0
0001: RAM_AREA1
0010: RAM_AREA2
0011: RAM_AREA3
0100: RAM_AREA4
0101: RAM_AREA5
0110: RAM_AREA6
0111: RAM_AREA7
1000: no RAM area selected
1001-1111:  Reserved
RAM areas RAM_AREA0, RAM_AREA2, RAM_AREA4 and RAM_AREA6 are the only valid read areas for 192 and 256 bits key sizes.
Only RAM areas that contain valid written keys can be selected.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AES_KEY2_0</name>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <description>AES_KEY2_0 / AES_GHASH_H_IN_0
Second Key / GHASH Key (internal, but clearable)
The following registers are not accessible through the host for reading and writing. They are used to store internally calculated key information and intermediate results. However, when the host performs a write to the any of the respective AES_KEY2_n or AES_KEY3_n addresses, respectively the whole 128-bit AES_KEY2_n or AES_KEY3_n register is cleared to 0s.
The AES_GHASH_H_IN_n registers (required for GHASH, which is part of GCM) are mapped to the AES_KEY2_n registers. The (intermediate) authentication result for GCM and CCM is stored in the AES_KEY3_n register.</description>
          <fields>
            <field>
              <name>AES_KEY2</name>
              <description>[31:0] AES_KEY2/AES_GHASH_H[31:0]

For GCM: 
-[127:0] - GHASH_H - The internally calculated GHASH key is stored in these registers. Only used for modes that use the GHASH function (GCM).
-[255:128] - This register is used to store intermediate values and is initialized with 0s when loading a new key.

For CCM:
-[255:0] - This register is used to store intermediate values.

For CBC-MAC:
-[255:0] - ZEROES - This register must remain 0.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AES_KEY2_1</name>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <description>AES_KEY2_1 / AES_GHASH_H_IN_1
Second Key / GHASH Key (internal, but clearable)
The following registers are not accessible through the host for reading and writing. They are used to store internally calculated key information and intermediate results. However, when the host performs a write to the any of the respective AES_KEY2_n or AES_KEY3_n addresses, respectively the whole 128-bit AES_KEY2_n or AES_KEY3_n register is cleared to 0s.
The AES_GHASH_H_IN_n registers (required for GHASH, which is part of GCM) are mapped to the AES_KEY2_n registers. The (intermediate) authentication result for GCM and CCM is stored in the AES_KEY3_n register.</description>
          <fields>
            <field>
              <name>AES_KEY2</name>
              <description>[31:0] AES_KEY2/AES_GHASH_H[63:32]

For GCM: 
-[127:0] - GHASH_H - The internally calculated GHASH key is stored in these registers. Only used for modes that use the GHASH function (GCM).
-[255:128] - This register is used to store intermediate values and is initialized with 0s when loading a new key.

For CCM:
-[255:0] - This register is used to store intermediate values.

For CBC-MAC:
-[255:0] - ZEROES - This register must remain 0.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AES_KEY2_2</name>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <description>AES_KEY2_2 / AES_GHASH_H_IN_2
Second Key / GHASH Key (internal, but clearable)
The following registers are not accessible through the host for reading and writing. They are used to store internally calculated key information and intermediate results. However, when the host performs a write to the any of the respective AES_KEY2_n or AES_KEY3_n addresses, respectively the whole 128-bit AES_KEY2_n or AES_KEY3_n register is cleared to 0s.
The AES_GHASH_H_IN_n registers (required for GHASH, which is part of GCM) are mapped to the AES_KEY2_n registers. The (intermediate) authentication result for GCM and CCM is stored in the AES_KEY3_n register.</description>
          <fields>
            <field>
              <name>AES_KEY2</name>
              <description>[31:0] AES_KEY2/AES_GHASH_H[95:64]

For GCM: 
-[127:0] - GHASH_H - The internally calculated GHASH key is stored in these registers. Only used for modes that use the GHASH function (GCM).
-[255:128] - This register is used to store intermediate values and is initialized with 0s when loading a new key.

For CCM:
-[255:0] - This register is used to store intermediate values.

For CBC-MAC:
-[255:0] - ZEROES - This register must remain 0.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AES_KEY2_3</name>
          <addressOffset>0x50c</addressOffset>
          <size>32</size>
          <description>AES_KEY2_3 / AES_GHASH_H_IN_3
Second Key / GHASH Key (internal, but clearable)
The following registers are not accessible through the host for reading and writing. They are used to store internally calculated key information and intermediate results. However, when the host performs a write to the any of the respective AES_KEY2_n or AES_KEY3_n addresses, respectively the whole 128-bit AES_KEY2_n or AES_KEY3_n register is cleared to 0s.
The AES_GHASH_H_IN_n registers (required for GHASH, which is part of GCM) are mapped to the AES_KEY2_n registers. The (intermediate) authentication result for GCM and CCM is stored in the AES_KEY3_n register.</description>
          <fields>
            <field>
              <name>AES_KEY2</name>
              <description>[31:0] AES_KEY2/AES_GHASH_H[127:96]

For GCM: 
-[127:0] - GHASH_H - The internally calculated GHASH key is stored in these registers. Only used for modes that use the GHASH function (GCM).
-[255:128] - This register is used to store intermediate values and is initialized with 0s when loading a new key.

For CCM:
-[255:0] - This register is used to store intermediate values.

For CBC-MAC:
-[255:0] - ZEROES - This register must remain 0.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AES_KEY3_0</name>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <description>AES_KEY3_0 / AES_KEY2_4
Third Key / Second Key (internal, but clearable)
The following registers are not accessible through the host for reading and writing. They are used to store internally calculated key information and intermediate results. However, when the host performs a write to the any of the respective AES_KEY2_n or AES_KEY3_n addresses, respectively the whole 128-bit AES_KEY2_n or AES_KEY3_n register is cleared to 0s.
The AES_GHASH_H_IN_n registers (required for GHASH, which is part of GCM) are mapped to the AES_KEY2_n registers. The (intermediate) authentication result for GCM and CCM is stored in the AES_KEY3_n register.</description>
          <fields>
            <field>
              <name>AES_KEY3</name>
              <description>[31:0] AES_KEY3[31:0]/AES_KEY2[159:128]

For GCM: 
-[127:0] - GHASH_H - The internally calculated GHASH key is stored in these registers. Only used for modes that use the GHASH function (GCM).
-[255:128] - This register is used to store intermediate values and is initialized with 0s when loading a new key.

For CCM:
-[255:0] - This register is used to store intermediate values.

For CBC-MAC:
-[255:0] - ZEROES - This register must remain 0.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AES_KEY3_1</name>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <description>AES_KEY3_1 / AES_KEY2_5
Third Key / Second Key (internal, but clearable)
The following registers are not accessible through the host for reading and writing. They are used to store internally calculated key information and intermediate results. However, when the host performs a write to the any of the respective AES_KEY2_n or AES_KEY3_n addresses, respectively the whole 128-bit AES_KEY2_n or AES_KEY3_n register is cleared to 0s.
The AES_GHASH_H_IN_n registers (required for GHASH, which is part of GCM) are mapped to the AES_KEY2_n registers. The (intermediate) authentication result for GCM and CCM is stored in the AES_KEY3_n register.</description>
          <fields>
            <field>
              <name>AES_KEY3</name>
              <description>[31:0] AES_KEY3[63:32]/AES_KEY2[191:160]

