pipex/cc2538/svd/cc2538sf53.svd
Continued hash:
These registers should be written with the context data, before the start of a resumed hash session (the new_hash bit in the HASH_MODE register is 0 when starting a hash session).

New hash:
When initiating a new hash session (the new_hash bit in the HASH_MODE register is high), the internal digest registers are automatically set to the SHA-256 algorithm constant and these register should not be written.

Reading from these registers provides the intermediate hash result (non-final hash operation) or the final hash result (final hash operation) after data processing.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTRL_ALG_SEL</name>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <description>Algorithm select
This algorithm selection register configures the internal destination of the DMA controller.</description>
          <fields>
            <field>
              <name>TAG</name>
              <description>[31:31] If this bit is cleared to 0, the DMA operation involves only data.
If this bit is set, the DMA operation includes a TAG (Authentication Result / Digest).
For SHA-256 operation, a DMA must be set up for both input data and TAG. For any other selected module, setting this bit only allows a DMA that reads the TAG. No data allowed to be transferred to or from the selected module via the DMA.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>Reserved28</name>
              <description>[30:3] Bits should be written with 0s and ignored on read.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>HASH</name>
              <description>[2:2] If set to one, selects the hash engine as destination for the DMA
The maximum transfer size to DMA engine is set to 64 bytes for reading and 32 bytes for writing (the latter is only applicable if the hash result is written out through the DMA).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AES</name>
              <description>[1:1] If set to one, selects the AES engine as source/destination for the DMA
The read and write maximum transfer size to the DMA engine is set to 16 bytes.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>KEYSTORE</name>
              <description>[0:0] If set to one, selects the Key Store as destination for the DMA
The maximum transfer size to DMA engine is set to 32 bytes (however transfers of 16, 24 and 32 bytes are allowed)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTRL_PROT_EN</name>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <description>Master PROT privileged access enable
This register enables the second bit (bit [1]) of the AHB HPROT bus of the AHB master interface when a read action of key(s) is performed on the AHB master interface for writing keys into the store module.</description>
          <fields>
            <field>
              <name>Reserved31</name>
              <description>[31:1] Bits should be written with 0s and ignored on read.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PROT_EN</name>
              <description>[0:0] If this bit is cleared to 0, m_h_prot[1] on the AHB mater interface always remains 0.
If this bit is set to one, the m_h_prot[1] signal on the master AHB bus is asserted to 1 if an AHB read operation is performed, using DMA, with the key store module as destination.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTRL_SW_RESET</name>
          <addressOffset>0x740</addressOffset>
          <size>32</size>
          <description>Software reset</description>
          <fields>
            <field>
              <name>Reserved31</name>
              <description>[31:1] Bits should be written with 0s and ignored on read.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SW_RESET</name>
              <description>[0:0] If this bit is set to 1, the following modules are reset: 
- Master control internal state is reset. That includes interrupt, error status register, and result available interrupt generation FSM. 
- Key store module state is reset. That includes clearing the written area flags; therefore, the keys must be reloaded to the key store module.
Writing 0 has no effect.
The bit is self cleared after executing the reset.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTRL_INT_CFG</name>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <description>Interrupt configuration</description>
          <fields>
            <field>
              <name>Reserved31</name>
              <description>[31:1] Bits should be written with 0s and ignored on read.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>LEVEL</name>
              <description>[0:0] If this bit is 0, the interrupt output is a pulse.
If this bit is set to 1, the interrupt is a level interrupt that must be cleared by writing the interrupt clear register.
This bit is applicable for both interrupt output signals.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTRL_INT_EN</name>
          <addressOffset>0x784</addressOffset>
          <size>32</size>
          <description>Interrupt enable</description>
          <fields>
            <field>
              <name>Reserved30</name>
              <description>[31:2] Bits should be written with 0s and ignored on read.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DMA_IN_DONE</name>
              <description>[1:1] If this bit is set to 0, the DMA input done (irq_dma_in_done) interrupt output is disabled and remains 0.
If this bit is set to 1, the DMA input done interrupt output is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESULT_AV</name>
              <description>[0:0] If this bit is set to 0, the result available (irq_result_av) interrupt output is disabled and remains 0.
If this bit is set to 1, the result available interrupt output is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTRL_INT_CLR</name>
          <addressOffset>0x788</addressOffset>
          <size>32</size>
          <description>Interrupt clear</description>
          <fields>
            <field>
              <name>DMA_BUS_ERR</name>
              <description>[31:31] If 1 is written to this bit, the DMA bus error status is cleared.
Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>KEY_ST_WR_ERR</name>
              <description>[30:30] If 1 is written to this bit, the key store write error status is cleared.
Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>KEY_ST_RD_ERR</name>
              <description>[29:29] If 1 is written to this bit, the key store read error status is cleared.
Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>Reserved27</name>
              <description>[28:2] Bits should be written with 0s and ignored on read.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DMA_IN_DONE</name>
              <description>[1:1] If 1 is written to this bit, the DMA in done (irq_dma_in_done) interrupt output is cleared.
Writing 0 has no effect.
Note that clearing an interrupt makes sense only if the interrupt output is programmed as level (refer to CTRL_INT_CFG).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESULT_AV</name>
              <description>[0:0] If 1 is written to this bit, the result available (irq_result_av) interrupt output is cleared.
Writing 0 has no effect.
Note that clearing an interrupt makes sense only if the interrupt output is programmed as level (refer to CTRL_INT_CFG).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTRL_INT_SET</name>
          <addressOffset>0x78c</addressOffset>
          <size>32</size>
          <description>Interrupt set</description>
          <fields>
            <field>
              <name>Reserved30</name>
              <description>[31:2] Bits should be written with 0s and ignored on read.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DMA_IN_DONE</name>
              <description>[1:1] If 1 is written to this bit, the DMA data in done (irq_dma_in_done) interrupt output is set to one.
Writing 0 has no effect.
If the interrupt configuration register is programmed to pulse, clearing the DMA data in done (irq_dma_in_done) interrupt is not needed. If it is programmed to level, clearing the interrupt output should be done by writing the interrupt clear register (CTRL_INT_CLR).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESULT_AV</name>
              <description>[0:0] If 1 is written to this bit, the result available (irq_result_av) interrupt output is set to one.
Writing 0 has no effect.
If the interrupt configuration register is programmed to pulse, clearing the result available (irq_result_av) interrupt is not needed. If it is programmed to level, clearing the interrupt output should be done by writing the interrupt clear register (CTRL_INT_CLR).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTRL_INT_STAT</name>
          <addressOffset>0x790</addressOffset>
          <size>32</size>
          <description>Interrupt status</description>
          <fields>
            <field>
              <name>DMA_BUS_ERR</name>
              <description>[31:31] This bit is set when a DMA bus error is detected during a DMA operation. The value of this register is held until it is cleared through the CTRL_INT_CLR register.
Note: This error is asserted if an error is detected on the AHB master interface during a DMA operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>KEY_ST_WR_ERR</name>
              <description>[30:30] This bit is set when a write error is detected during the DMA write operation to the key store memory. The value of this register is held until it is cleared through the CTRL_INT_CLR register.
Note: This error is asserted if a DMA operation does not cover a full key area or more areas are written than expected.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>KEY_ST_RD_ERR</name>
              <description>[29:29] This bit is set when a read error is detected during the read of a key from the key store, while copying it to the AES core. The value of this register is held until it is cleared through the CTRL_INT_CLR register.
Note: This error is asserted if a key location is selected in the key store that is not available.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>Reserved27</name>
              <description>[28:2] Bits should be ignored</description>
              <bitWidth>27</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DMA_IN_DONE</name>
              <description>[1:1] This read only bit returns the actual DMA data in done (irq_data_in_done) interrupt status of the DMA data in done interrupt output pin (irq_data_in_done).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESULT_AV</name>
              <description>[0:0] This read only bit returns the actual result available (irq_result_av) interrupt status of the result available interrupt output pin (irq_result_av).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTRL_OPTIONS</name>
          <addressOffset>0x7f8</addressOffset>
          <size>32</size>
          <description>Options register</description>
          <fields>
            <field>
              <name>TYPE</name>
              <description>[31:24] This field is 0x01 for the TYPE1 device.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>Reserved7</name>
              <description>[23:17] Bits should be ignored</description>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>AHBINTERFACE</name>
              <description>[16:16] AHB interface is available
If this bit is 0, the EIP-120t has a TCM interface.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved1</name>
              <description>[15:9] Bits should be ignored</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>SHA_256</name>
              <description>[8:8] The HASH core supports SHA-256.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AES_CCM</name>
              <description>[7:7] AES-CCM is available as a single operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>AES_GCM</name>
              <description>[6:6] AES-GCM is available as a single operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>AES_256</name>
              <description>[5:5] AES core supports 256-bit keys
Note: If both AES-128 and AES-256 are set to one, the AES core supports 192-bit keys as well.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>AES_128</name>
              <description>[4:4] AES core supports 128-bit keys.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[3:3] Bit should be ignored</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>HASH</name>
              <description>[2:2] HASH Core is available.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AES</name>
              <description>[1:1] AES core is available.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>KEYSTORE</name>
              <description>[0:0] KEY STORE is available.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTRL_VERSION</name>
          <addressOffset>0x7fc</addressOffset>
          <size>32</size>
          <description>Version register</description>
          <fields>
            <field>
              <name>Reserved1</name>
              <description>[31:28] Bit should be ignored</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>MAJOR_VERSION</name>
              <description>[27:24] Major version number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>MINOR_VERSION</name>
              <description>[23:20] Minor version number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>PATCH_LEVEL</name>
              <description>[19:16] Patch level
Starts at 0 at first delivery of this version</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>EIP_NUMBER_COMPL</name>
              <description>[15:8] These bits simply contain the complement of bits [7:0] (0x87), used by a driver to ascertain that the EIP-120t register is indeed read.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EIP_NUMBER</name>
              <description>[7:0] These bits encode the EIP number for the EIP-120t, this field contains the value 120 (decimal) or 0x78.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
