pipex/cc2538/svd/cc2538sf53.svd
        <register>
          <name>DCGCUART</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for UART[1:0] when the CPU is in PM0. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:2] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UART1</name>
              <description>[1:1] 0: Clock for UART1 is gated.
1: Clock for UART1 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UART0</name>
              <description>[0:0] 0: Clock for UART0 is gated.
1: Clock for UART0 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRUART</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>This register controls the reset for UART[1:0].</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:2] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UART1</name>
              <description>[1:1] 0: UART1 module is not reset
1: UART1 module is reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UART0</name>
              <description>[0:0] 0: UART0 module is not reset
1: UART0 module is reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RCGCI2C</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for I2C when the CPU is in active (run) mode. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:1] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>I2C0</name>
              <description>[0:0] 0: Clock for I2C0 is gated.
1: Clock for I2C0 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SCGCI2C</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for I2C when the CPU is in sleep mode. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:1] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>I2C0</name>
              <description>[0:0] 0: Clock for I2C0 is gated.
1: Clock for I2C0 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DCGCI2C</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for I2C when the CPU is in PM0. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:1] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>I2C0</name>
              <description>[0:0] 0: Clock for I2C0 is gated.
1: Clock for I2C0 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRI2C</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>This register controls the reset for I2C.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:1] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>I2C0</name>
              <description>[0:0] 0: I2C0 module is not reset
1: I2C0 module is reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RCGCSEC</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for the security module when the CPU is in active (run) mode. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:2] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AES</name>
              <description>[1:1] 0: Clock for AES is gated.
1: Clock for AES is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PKA</name>
              <description>[0:0] 0: Clock for PKA is gated.
1: Clock for PKA is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SCGCSEC</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for the security module when the CPU is in sleep mode. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:2] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AES</name>
              <description>[1:1] 0: Clock for AES is gated.
1: Clock for AES is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PKA</name>
              <description>[0:0] 0: Clock for PKA is gated.
1: Clock for PKA is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DCGCSEC</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for the security module when the CPU is in PM0. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:2] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AES</name>
              <description>[1:1] 0: Clock for AES is gated.
1: Clock for AES is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PKA</name>
              <description>[0:0] 0: Clock for PKA is gated.
1: Clock for PKA is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRSEC</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>This register controls the reset for the security module.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:2] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AES</name>
              <description>[1:1] 0: AES module is not reset
1: AES module is reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PKA</name>
              <description>[0:0] 0: PKA module is not reset
1: PKA module is reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PMCTL</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>This register controls the power mode.
Note: The Corresponding PM is not entered before the WFI instruction is asserted. To enter PM1-3 the DEEPSLEEP bit in SYSCTRL must be 1.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:2] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PM</name>
              <description>[1:0] 00: No action
01: PM1
10: PM2
11: PM3</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCRC</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>This register controls CRC on state retention.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:13] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>19</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>Reserved12</name>
              <description>[12:12] Reserved</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>Reserved10</name>
              <description>[11:10] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>Reserved9</name>
              <description>[9:9] Reserved</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>CRC_REN_USB</name>
              <description>[8:8] 1: Enable reset of chip if CRC fails.
0: Disable reset feature of chip due to CRC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:5] Reserved</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>Reserved4</name>
              <description>[4:4] Reserved</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[3:2] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>Reserved1</name>
              <description>[1:1] Reserved</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CRC_REN_RF</name>
              <description>[0:0] 1: Enable reset of chip if CRC fails.
0: Disable reset feature of chip due to CRC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PWRDBG</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>Power debug register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>FORCE_WARM_RESET</name>
              <description>[3:3] 0: No action
1: When written high, the chip is reset in the same manner as a CLD event and is readable from the RST field in the CLOCK_STA register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[2:2] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>Reserved1</name>
              <description>[1:1] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>Reserved</name>
              <description>[0:0] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CLD</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>This register controls the clock loss detection feature.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:9] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>VALID</name>
              <description>[8:8] 0: CLD status in always-on domain is not equal to status in the EN register.
1: CLD status in always-on domain and EN register are equal.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:1] Reserved. Always read zero</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] 0: CLD is disabled.
1: CLD is enabled.
Writing to this register shall be ignored if VALID = 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IWE</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>This register controls interrupt wake-up.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:6] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SM_TIMER_IWE</name>
              <description>[5:5] 1: Enable SM Timer wake-up interrupt.
0: Disable SM Timer wake-up interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>USB_IWE</name>
              <description>[4:4] 1: Enable USB wake-up interrupt.
0: Disable USB wake-up interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PORT_D_IWE</name>
              <description>[3:3] 1: Enable port D wake-up interrupt.
0: Disable port D wake-up interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PORT_C_IWE</name>
              <description>[2:2] 1: Enable port C wake-up interrupt.
0: Disable port C wake-up interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PORT_B_IWE</name>
              <description>[1:1] 1: Enable port B wake-up interrupt.
0: Disable port B wake-up interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PORT_A_IWE</name>
              <description>[0:0] 1: Enable port A wake-up interrupt.
0: Disable port A wake-up interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>I_MAP</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>This register selects which interrupt map to be used.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:1] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ALTMAP</name>
              <description>[0:0] 1: Select alternate interrupt map.
0: Select regular interrupt map.
(See the ASD document for details.)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RCGCRFC</name>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for RF CORE when the CPU is in active (run) mode. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:1] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RFC0</name>
              <description>[0:0] 0: Clock for RF CORE is gated.
1: Clock for RF CORE is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SCGCRFC</name>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for RF CORE when the CPU is in sleep mode. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:1] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RFC0</name>
              <description>[0:0] 0: Clock for RF CORE is gated.
1: Clock for RF CORE is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DCGCRFC</name>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for RF CORE when the CPU is in PM0. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:1] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RFC0</name>
              <description>[0:0] 0: Clock for RF CORE is gated.
1: Clock for RF CORE is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
