pipex/cc2538/svd/cc2538sf53.svd
        <register>
          <name>EMUOVR</name>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <description>This register defines the emulator override controls for power mode and peripheral clock gate.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Unused. This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ICEPICK_FORCE_CLOCK_CG</name>
              <description>[7:7] ICEPick 'Force Active' clock gate override bit. 'Force Active' is an ICEPick command.

1 --> In non-sleep power mode, peripherals clocks are forced to follow RCG* register settings. It forces CM3 clocks on.

0 --> Does not affect the peripheral clock settings.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>ICEPICK_FORCE_POWER_CG</name>
              <description>[6:6] ICEPick 'Force Power' clock gate override bit. 'Force Power' is an ICEPick command.

1 --> In non-sleep power mode, peripherals clocks are forced to follow RCG* register settings. It forces CM3 clocks on.

0 --> Does not affect the peripheral clock settings.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>ICEPICK_INHIBIT_SLEEP_CG</name>
              <description>[5:5] ICEPick 'Inhibit Sleep' clock gate override bit. 'Inhibit Sleep' is an ICEPick command.

1 --> In non-sleep power mode, peripherals clocks are forced to follow RCG* register settings. It forces CM3 clocks on.

0 --> Does not affect the peripheral clock settings.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>ICEMELTER_WKUP_CG</name>
              <description>[4:4] ICEMelter 'WAKEUPEMU' clock gate override bit.

1 --> In non-sleep power mode, peripherals clocks are forced to follow RCG* register settings. It forces CM3 clocks on.

0 --> Does not affect the peripheral clock settings</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>ICEPICK_FORCE_CLOCK_PM</name>
              <description>[3:3] ICEPick 'Force Active' power mode override bit. 'Force Active' is an ICEPick command.

1 --> Prohibit the system to go into any power down modes. Keeps the emulator attached.
0 --> Does not override any power mode settings from SYSREGS and does not prohibit system to go into any power down modes.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>ICEPICK_FORCE_POWER_PM</name>
              <description>[2:2] ICEPick 'Force Power' power mode override bit. 'Force Power' is an ICEPick command.

1 --> Prohibit the system to go into any power down modes. Keeps the emulator attached.
0 --> Does not override any power mode settings from SYSREGS and does not prohibit system to go into any power down modes.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ICEPICK_INHIBIT_SLEEP_PM</name>
              <description>[1:1] ICEPick 'Inhibit Sleep' power mode override bit. 'Inhibit Sleep' is an ICEPick command.

1 --> Prohibit the system to go into any power down modes. Keeps the emulator attached.
0 --> Does not override any power mode settings from SYSREGS and does not prohibit system to go into any power down modes.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ICEMELTER_WKUP_PM</name>
              <description>[0:0] ICEMelter 'WAKEUPEMU' power mode override bit.

1 --> Prohibit the system to go into any power down modes. Keeps the emulator attached.
0 --> Does not override any power mode settings from SYSREGS and does not prohibit system to go into any power down modes.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH_CTRL</name>
      <baseAddress>0x400D3000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>FCTL</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Flash control
This register provides control and monitoring functions for the flash module.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:10] Unused</description>
              <bitWidth>22</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>UPPER_PAGE_ACCESS</name>
              <description>[9:9] Lock bit for lock bit page
0: Neither write nor erase not allowed
1: Both write and erase allowed</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>SEL_INFO_PAGE</name>
              <description>[8:8] Flash erase or write operation on APB bus must assert this when accessing the information page</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BUSY</name>
              <description>[7:7] Set when the WRITE or ERASE bit is set; that is, when the flash controller is busy</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>FULL</name>
              <description>[6:6] Write buffer full
The CPU can write to FWDATA when this bit is 0 and WRITE is 1. This bit is cleared when BUSY is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>ABORT</name>
              <description>[5:5] Abort status
This bit is set to 1 when a write sequence or page erase is aborted. An operation is aborted when the accessed page is locked. Cleared when a write or page erase is started.
If a write operation times out (because the FWDATA register is not written fast enough), the ABORT bit is not set even if the page is locked.
If a page erase and a write operation are started simultaneously, the ABORT bit reflects the status of the last write operation. For example, if the page is locked and the write times out, the ABORT bit is not set because only the write operation times out.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>Reserved5</name>
              <description>[4:4] Reserved</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CM</name>
              <description>[3:2] Cache Mode
Disabling the cache increases the power consumption and reduces performance. Prefetching improves performance at the expense of a potential increase in power consumption. Real-time mode provides predictable flash read access time, the execution time is equal to cache disabled mode, but the power consumption is lower.
00: Cache disabled
01: Cache enabled
10: Cache enabled, with prefetch
11: Real-time mode
Note: The read value always represents the current cache mode. Writing a new cache mode starts a cache mode change request that does not take effect until the controller is ready. Writes to this register are ignored if there is a current cache change request in progress.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>WRITE</name>
              <description>[1:1] Write bit
Start a write sequence by setting this bit to 1. Cleared by hardware when the operation completes. Writes to this bit are ignored when FCTL.BUSY is 1. If FCTL.ERASE is set simultaneously with this bit, the erase operation is started first, then the write is started.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ERASE</name>
              <description>[0:0] Erase bit
Start an erase operation by setting this bit to 1. Cleared by hardware when the operation completes. Writes to this bit are ignored when FCTL.BUSY is 1. If FCTL.WRITE is set simultaneously with this bit, the erase operation is started first, then the write is started.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FADDR</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Flash address
The register sets the address to be written in flash memory. See the bitfield descriptions for formatting information.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:17] Unused. These bits always reflect 0 on read back</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>FADDR</name>
              <description>[16:0] Bit number [16:9] selects one of 256 pages for page erase. 
Bit number [8:7] selects one of the 4 row in a given page
Bit number [6:1] selects one of the 64-bit wide locations in a give row.
Bit number [0] will select upper/lower 32-bits in a given 64-bit location
- 64Kbytes --> Bits [16:14] will always be 0.
- 128Kbytes --> Bits [16:15] will always be 0.
- 256Kbytes --> Bit [16] will always be 0.
- 384/512Kbytes --> All bits written and valid.

Writes to this register will be ignored when any of FCTL.WRITE and FCTL.ERASE is set.

