pipex/cc2538/svd/cc2538sf53.svd
FADDR should be written with byte addressable location of the Flash to be programmed.

Read back value always reflects a 32-bit aligned address. When the register is read back, the value that was written to FADDR gets right shift by 2 to indicate 32-bit aligned address. In other words lower 2 bits are discarded while reading back the register.

Out of range address results in roll over. There is no status signal generated by flash controller to indicate this. Firmware is responsible to managing the addresses correctly.</description>
              <bitWidth>17</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FWDATA</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Flash data
This register contains the 32-bits of data to be written to the flash location selected in FADDR.</description>
          <fields>
            <field>
              <name>FWDATA</name>
              <description>[31:0] 32-bit flash write data
Writes to this register are accepted only during a flash write sequence; that is, writes to this register after having written 1 to the FCTL.WRITE bit. New 32-bit data is written only if FCTL.FULL = 0.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIECFG0</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>These settings are a function of the FLASH information page bit settings, which are programmed during production test, and are subject for specific configuration for multiple device flavors of cc2538.</description>
          <fields>
            <field>
              <name>CHIPID</name>
              <description>[31:16] Register copy of configuration bits
Three clock cycles after reset is released, this bit field is equal to the field with the same name in the information page.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved16</name>
              <description>[15:11] Unused</description>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CLK_SEL_GATE_EN_N</name>
              <description>[10:10] Register copy of configuration bits
Three clock cycles after reset is released, this bit is equal to the field with the same name in the information page.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>SRAM_SIZE</name>
              <description>[9:7] Register copy of configuration bits
Three clock cycles after reset is released, this bit field is equal to the field with the same name in the information page.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>FLASH_SIZE</name>
              <description>[6:4] Register copy of configuration bits
Three clock cycles after reset is released, this bit field is equal to the field with the same name in the information page.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>USB_ENABLE</name>
              <description>[3:3] Register copy of configuration bits
Three clock cycles after reset is released, this bit is equal to the field with the same name in the information page.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MASS_ERASE_ENABLE</name>
              <description>[2:2] Register copy of configuration bits
Three clock cycles after reset is released, this bit is equal to the field with the same name in the information page.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>LOCK_FWT_N</name>
              <description>[1:1] Register copy of configuration bits
Three clock cycles after reset is released, this bit is equal to the field with the same name in the information page.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>LOCK_IP_N</name>
              <description>[0:0] Register copy of configuration bits
Three clock cycles after reset is released, this bit is equal to the field with the same name in the information page.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIECFG1</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>These settings are a function of the FLASH information page bit settings, which are programmed during production test, and are subject for specific configuration for multiple device flavors of cc2538.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:25] Unused</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>I2C_EN</name>
              <description>[24:24] 1: I2C is enabled.
0: I2C is permanently disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>Reserved24</name>
              <description>[23:18] Unused</description>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>UART1_EN</name>
              <description>[17:17] 1: UART1 is enabled.
0: UART1 is permanently disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>UART0_EN</name>
              <description>[16:16] 1: UART0 is enabled.
0: UART0 is permanently disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved16</name>
              <description>[15:10] Unused</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>SSI1_EN</name>
              <description>[9:9] 1: SSI1 is enabled.
0: SSI1 is permanently disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>SSI0_EN</name>
              <description>[8:8] 1: SSI0 is enabled.
0: SSI0 is permanently disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:4] Unused</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>GPTM3_EN</name>
              <description>[3:3] 1: GPTM3 is enabled.
0: GPTM3 is permanently disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>GPTM2_EN</name>
              <description>[2:2] 1: GPTM2 is enabled.
0: GPTM2 is permanently disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>GPTM1_EN</name>
              <description>[1:1] 1: GPTM1 is enabled.
0: GPTM1 is permanently disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>GPTM0_EN</name>
              <description>[0:0] 1: GPTM0 is enabled.
0: GPTM0 is permanently disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIECFG2</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>These settings are a function of the FLASH information page bit settings, which are programmed during production test, and are subject for specific configuration for multiple device flavors of cc2538. The DIE_*_REVISION registers are an exeception to this, as they are hardwired and are not part of the FLASH information page.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Unused</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DIE_MAJOR_REVISION</name>
              <description>[15:12] Indicates the major revision (all layer change) number for the cc2538
0x0 - PG1.0
0x2 - PG2.0</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>DIE_MINOR_REVISION</name>
              <description>[11:8] Indicates the minor revision (metla layer only) number for the cc2538
0x0 - PG1.0 or PG2.0</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:3] Unused</description>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RF_CORE_EN</name>
              <description>[2:2] 1: RF_CORE is enabled.
0: RF_CORE is permanently disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AES_EN</name>
              <description>[1:1] 1: AES is enabled.
0: AES is permanently disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PKA_EN</name>
              <description>[0:0] 1: PKA is enabled.
0: PKA is permanently disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
