pipex/cc2538/svd/cc2538sf53.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IOC</name>
      <baseAddress>0x400D4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000154</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>PA0_SEL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PA0</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PA0_sel</name>
              <description>[4:0] Select one peripheral signal output for PA0.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA1_SEL</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PA1</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PA1_sel</name>
              <description>[4:0] Select one peripheral signal output for PA1.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA2_SEL</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PA2</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PA2_sel</name>
              <description>[4:0] Select one peripheral signal output for PA2.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA3_SEL</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PA3</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PA3_sel</name>
              <description>[4:0] Select one peripheral signal output for PA3.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA4_SEL</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PA4</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PA4_sel</name>
              <description>[4:0] Select one peripheral signal output for PA4.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA5_SEL</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PA5</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PA5_sel</name>
              <description>[4:0] Select one peripheral signal output for PA5.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA6_SEL</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PA6</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PA6_sel</name>
              <description>[4:0] Select one peripheral signal output for PA6.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA7_SEL</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PA7</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PA7_sel</name>
              <description>[4:0] Select one peripheral signal output for PA7.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB0_SEL</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PB0</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PB0_sel</name>
              <description>[4:0] Select one peripheral signal output for PB0.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB1_SEL</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PB1</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PB1_sel</name>
              <description>[4:0] Select one peripheral signal output for PB1.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB2_SEL</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PB2</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PB2_sel</name>
              <description>[4:0] Select one peripheral signal output for PB2.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB3_SEL</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PB3</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PB3_sel</name>
              <description>[4:0] Select one peripheral signal output for PB3.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB4_SEL</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PB4</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PB4_sel</name>
              <description>[4:0] Select one peripheral signal output for PB4.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB5_SEL</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PB5</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PB5_sel</name>
              <description>[4:0] Select one peripheral signal output for PB5.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB6_SEL</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PB6</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PB6_sel</name>
              <description>[4:0] Select one peripheral signal output for PB6.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB7_SEL</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PB7</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PB7_sel</name>
              <description>[4:0] Select one peripheral signal output for PB7.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC0_SEL</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PC0</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PC0_sel</name>
              <description>[4:0] Select one peripheral signal output for PC0.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC1_SEL</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PC1</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PC1_sel</name>
              <description>[4:0] Select one peripheral signal output for PC1.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC2_SEL</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PC2</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PC2_sel</name>
              <description>[4:0] Select one peripheral signal output for PC2.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC3_SEL</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PC3</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PC3_sel</name>
              <description>[4:0] Select one peripheral signal output for PC3.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC4_SEL</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PC4</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PC4_sel</name>
              <description>[4:0] Select one peripheral signal output for PC4.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC5_SEL</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PC5</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PC5_sel</name>
              <description>[4:0] Select one peripheral signal output for PC5.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC6_SEL</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PC6</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PC6_sel</name>
              <description>[4:0] Select one peripheral signal output for PC6.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC7_SEL</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PC7</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PC7_sel</name>
              <description>[4:0] Select one peripheral signal output for PC7.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PD0_SEL</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PD0</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PD0_sel</name>
              <description>[4:0] Select one peripheral signal output for PD0.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PD1_SEL</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PD1</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PD1_sel</name>
              <description>[4:0] Select one peripheral signal output for PD1.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PD2_SEL</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PD2</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PD2_sel</name>
              <description>[4:0] Select one peripheral signal output for PD2.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PD3_SEL</name>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PD3</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PD3_sel</name>
              <description>[4:0] Select one peripheral signal output for PD3.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PD4_SEL</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PD4</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PD4_sel</name>
              <description>[4:0] Select one peripheral signal output for PD4.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PD5_SEL</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PD5</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PD5_sel</name>
              <description>[4:0] Select one peripheral signal output for PD5.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PD6_SEL</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PD6</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PD6_sel</name>
              <description>[4:0] Select one peripheral signal output for PD6.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
