pipex/cc2538/svd/cc2538sf53.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SMWDTHROSC</name>
      <baseAddress>0x400D5000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>WDCTL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Watchdog Timer Control</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CLR</name>
              <description>[7:4] Clear timer
When 0xA followed by 0x5 is written to these bits, the timer is loaded with 0x0000. Note that 0x5 must be written within one watchdog clock period Twdt after 0xA was written for the clearing to take effect (ensured). 
If 0x5 is written between Twdt and 2Twdt after 0xA was written, the clearing may take effect, but there is no guarantee. If 0x5 is written > 2Twdt after 0xA was written, the timer will not be cleared. 
If a value other than 0x5 is written after 0xA has been written, the clear sequence is aborted. If 0xA is written, this starts a new clear sequence. 
Writing to these bits when EN = 0 has no effect.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[3:3] Enable timer
When 1 is written to this bit the timer is enabled and starts incrementing. The interval setting specified by INT[1:0] is used. 
Writing 0 to this bit have no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[2:2] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>INT</name>
              <description>[1:0] Timer interval select
These bits select the timer interval as follows: 
00: Twdt x 32768 
01: Twdt x 8192 
10: Twdt x 512 
11: Twdt x 64 
Writing these bits when EN = 1 has no effect.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ST0</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Sleep Timer 0 count and compare</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ST0</name>
              <description>[7:0] Sleep Timer count and compare value. When read, this register returns the low bits [7:0] of the Sleep Timer count. When writing this register sets the low bits [7:0] of the compare value.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ST1</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Sleep Timer 1 count and compare</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ST1</name>
              <description>[7:0] Sleep Timer count and compare value
When read, this register returns the middle bits [15:8] of the Sleep Timer count. When writing this register sets the middle bits [15:8] of the compare value. The value read is latched at the time of reading register ST0. The value written is latched when ST0 is written.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ST2</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Sleep Timer 2 count and compare</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ST2</name>
              <description>[7:0] Sleep Timer count and compare value
When read, this register returns the high bits [23:16] of the Sleep Timer count. When writing this register sets the high bits [23:16] of the compare value. The value read is latched at the time of reading register ST0. The value written is latched when ST0 is written.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ST3</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>Sleep Timer 3 count and compare</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ST3</name>
              <description>[7:0] Sleep Timer count and compare value
When read, this register returns the high bits [31:24] of the Sleep Timer count. When writing this register sets the high bits [31:24] of the compare value. The value read is latched at the time of reading register ST0. The value written is latched when ST0 is written.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STLOAD</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>Sleep Timer load status</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved7</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STLOAD</name>
              <description>[0:0] Status signal for when STx registers have been uploaded to 32-kHz counter.
1: Load is complete
0: Load is busy and STx regs are blocked for writing</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STCC</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>Sleep Timer Capture control</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PORT</name>
              <description>[5:3] Port select
Valid settings are 0-3, all others inhibit any capture from occurring
000: Port A selected
001: Port B selected
010: Port C selected
011: Port D selected</description>
              <bitWidth>3</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PIN</name>
              <description>[2:0] Pin select
Valid settings are 1-7 when either port A, B, C, or D is selected.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STCS</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>Sleep Timer Capture status</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved7</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>VALID</name>
              <description>[0:0] Capture valid flag
Set to 1 when capture value in STCV has been updated
Clear explicitly to allow new capture</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STCV0</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>Sleep Timer Capture value byte 0</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>STCV0</name>
              <description>[7:0] Bits [7:0] of Sleep Timer capture value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STCV1</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>Sleep Timer Capture value byte 1</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>STCV1</name>
              <description>[7:0] Bits [15:8] of Sleep Timer capture value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STCV2</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>Sleep Timer Capture value byte 2</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>STCV2</name>
              <description>[7:0] Bits [23:16] of Sleep Timer capture value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STCV3</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>Sleep Timer Capture value byte 3</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>STCV3</name>
              <description>[7:0] Bits [32:24] of Sleep Timer capture value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
