pipex/cc2538/svd/cc2538sf53.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ANA_REGS</name>
      <baseAddress>0x400D6000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>IVCTRL</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Analog control register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>Reserved7</name>
              <description>[6:6] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DAC_CURR_CTRL</name>
              <description>[5:4] Controls bias current to DAC
00: 100% IVREF, 0% IREF bias
01: 60% IVREF, 40% IREF bias
10: 40% IVREF, 60% IREF bias
11: 0% IVREF, 100% IREF bias</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>LODIV_BIAS_CTRL</name>
              <description>[3:3] Controls bias current to LODIV
1: PTAT bias
0: IVREF bias</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>TXMIX_DC_CTRL</name>
              <description>[2:2] Controls DC bias in TXMIX</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PA_BIAS_CTRL</name>
              <description>[1:0] Controls bias current to PA
00: IREF bias
01: IREF and IVREF bias (CC2530 mode)
10: PTAT bias
11: Increased PTAT slope bias</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SOC_ADC</name>
      <baseAddress>0x400D7000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>ADCCON1</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>This register controls the ADC.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EOC</name>
              <description>[7:7] End of conversion. Cleared when ADCH has been read. If a new conversion is completed before the previous data has been read, the EOC bit remains high.
0: Conversion not complete
1: Conversion completed</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>ST</name>
              <description>[6:6] Start conversion
Read as 1 until conversion completes
0: No conversion in progress.
1: Start a conversion sequence if ADCCON1.STSEL = 11 and no sequence is running.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>STSEL</name>
              <description>[5:4] Start select
Selects the event that starts a new conversion sequence
00: Not implemented
01: Full speed. Do not wait for triggers
10: Timer 1 channel 0 compare event
11: ADCCON1.ST = 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RCTRL</name>
              <description>[3:2] Controls the 16-bit random-number generator (see User Guide Chapter 16)
When 01 is written, the setting automatically returns to 00 when the operation completes.

00: Normal operation (13x unrolling)
01: Clock the LFSR once (13x unrolling)
10: Reserved
11: Stopped. The random-number generator is turned off.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>Reserved1</name>
              <description>[1:0] Reserved. Always set to 11.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADCCON2</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>This register controls the ADC.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SREF</name>
              <description>[7:6] Selects reference voltage used for the sequence of conversions
00: Internal reference
01: External reference on AIN7 pin
10: AVDD5 pin
11: External reference on AIN6-AIN7 differential input</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SDIV</name>
              <description>[5:4] Sets the decimation rate for channels included in the sequence of conversions. The decimation
rate also determines the resolution and time required to complete a conversion.
00: 64 decimation rate (7 bits ENOB setting)
01: 128 decimation rate (9 bits ENOB setting)
10: 256 decimation rate (10 bits ENOB setting)
11: 512 decimation rate (12 bits ENOB setting)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SCH</name>
              <description>[3:0] Sequence channel select
Selects the end of the sequence
A sequence can either be from AIN0 to AIN7 (SCH &lt;= 7) or from differential input AIN0-AIN1 to AIN6-AIN7 (8 &lt;= SCH &lt;= 11). For other
settings, only one conversions is performed.
When read, these bits indicate the channel number on which a conversion is ongoing:
0000: AIN0
0001: AIN1
0010: AIN2
0011: AIN3
0100: AIN4
0101: AIN5
0110: AIN6
0111: AIN7
1000: AIN0-AIN1
1001: AIN2-AIN3
1010: AIN4-AIN5
1011: AIN6-AIN7
1100: GND
1101: Reserved
1110: Temperature sensor
1111: VDD/3</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADCCON3</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>This register controls the ADC.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EREF</name>
              <description>[7:6] Selects reference voltage used for the extra conversion
00: Internal reference
01: External reference on AIN7 pin
10: AVDD5 pin
11: External reference on AIN6-AIN7 differential input</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>EDIV</name>
              <description>[5:4] Sets the decimation rate used for the extra conversion
The decimation rate also determines the resolution and the time required to complete the conversion.
00: 64 decimation rate (7 bits ENOB)
01: 128 decimation rate (9 bits ENOB)
10: 256 decimation rate (10 bits ENOB)
11: 512 decimation rate (12 bits ENOB)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>ECH</name>
              <description>[3:0] Single channel select. Selects the channel number of the single conversion that is triggered by
writing to ADCCON3.
0000: AIN0
0001: AIN1
0010: AIN2
0011: AIN3
0100: AIN4
0101: AIN5
0110: AIN6
0111: AIN7
1000: AIN0-AIN1
1001: AIN2-AIN3
1010: AIN4-AIN5
1011: AIN6-AIN7
1100: GND
1101: Reserved
1110: Temperature sensor
1111: VDD/3</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADCL</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>This register contains the least-significant part of ADC conversion result.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ADC</name>
              <description>[7:2] Least-significant part of ADC conversion result</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>Reserved1</name>
              <description>[1:0] Reserved. Always read as 0.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADCH</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>This register contains the most-significant part of ADC conversion result.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ADC</name>
              <description>[7:0] Most-significant part of ADC conversion result</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RNDL</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>This registers contains random-number-generator data; low byte.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RNDL</name>
              <description>[7:0] Random value/seed or CRC result, low byte
When used for random-number generation, writing to this register twice seeds the random-number generator. Writing to this register copies the 8 LSBs of the LFSR to the 8 MSBs and replaces the 8 LSBs with the data value written. The value returned when reading from this register is the 8 LSBs of the LFSR. When used for random-number generation, reading this register returns the 8 LSBs of the random number. When used for CRC calculations, reading this register returns the 8 LSBs of the CRC result.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RNDH</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>This register contains random-number-generator data; high byte.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RNDH</name>
              <description>[7:0] Random value or CRC result/input data, high byte
When written, a CRC16 calculation is triggered, and the data value written is processed starting with the MSB.
The value returned when reading from this register is the 8 MSBs of the LFSR.
When used for random-number generation, reading this register returns the 8 MSBs of the random number. When used for CRC calculations, reading this register returns the 8 MSBs of the
CRC result.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CMPCTL</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Analog comparator control and status register.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved</name>
              <description>[7:2] Reserved</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[1:1] Comparator enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>OUTPUT</name>
              <description>[0:0] Comparator output</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
