pipex/cc2538/svd/cc2538sf53.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO_B</name>
      <baseAddress>0x400DA000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>DATA</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>This is the data register. In software control mode, values written in
the GPIODATA register are transferred onto the GPOUT pins if the respective pins have been configured as outputs through the GPIODIR register. A read from GPIODATA returns the last bit value written if the respective pins are configured as output, or it returns the value on the corresponding input GPIN bit when these are configured as inputs.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DATA</name>
              <description>[7:0] Input and output data</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIR</name>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <description>The DIR register is the data direction register. All bits are cleared by a reset; therefore, the GPIO pins are input by default.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DIR</name>
              <description>[7:0] Bits set: Corresponding pin is output
Bits cleared: Corresponding pin is input</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IS</name>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <description>The IS register is the interrupt sense register.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>IS</name>
              <description>[7:0] Bits set: Level on corresponding pin is detected
Bits cleared: Edge on corresponding pin is detected</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IBE</name>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <description>The IBE register is the interrupt both-edges register. When the corresponding bit in IS is set to detect edges, bits set to high in IBE configure the corresponding pin to detect both rising and falling edges, regardless of the corresponding bit in the IEV (interrupt event register). Clearing a bit configures the pin to be controlled by IEV.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>IBE</name>
              <description>[7:0] Bits set: Both edges on corresponding pin trigger an interrupt
Bits cleared: Interrupt generation event is controlled by GPIOIEV
Single edge: Determined by corresponding bit in GPIOIEV register</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IEV</name>
          <addressOffset>0x40c</addressOffset>
          <size>32</size>
          <description>The IEV register is the interrupt event register. Bits set to high in IEV
configure the corresponding pin to detect rising edges or high levels, depending on the corresponding bit value in IS. Clearing a bit configures the pin to detect falling edges or low levels, depending on the corresponding bit value in IS.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>IEV</name>
              <description>[7:0] Bits set: Rising edges or high levels on corresponding pin trigger interrupts
Bits cleared: Falling edges or low levels on corresponding pin trigger interrupts</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IE</name>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <description>The IE register is the interrupt mask register. Bits set to high in IE allow the corresponding pins to trigger their individual interrupts and the combined GPIOINTR line. Clearing a bit disables interrupt triggering on that pin.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>IE</name>
              <description>[7:0] Bits set: Corresponding pin is not masked
Bits cleared: Corresponding pin is masked</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RIS</name>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <description>The RIS register is the raw interrupt status register. Bits read high in RIS reflect the status of interrupts trigger conditions detected (raw, before masking), indicating that all the requirements are met, before they are finally allowed to trigger by IE. Bits read as 0 indicate that corresponding input pins have not initiated an interrupt.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RIS</name>
              <description>[7:0] Reflects the status of interrupts trigger conditions detected on pins (raw, before masking)
Bits set: Requirements met by corresponding pins
Bits clear: Requirements not met</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MIS</name>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <description>The MIS register is the masked interrupt status register. Bits read high in MIS reflect the status of input lines triggering an interrupt. Bits read as low indicate that either no interrupt has been generated, or the interrupt is masked. MIS is the state of the interrupt after masking.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MIS</name>
              <description>[7:0] Masked value of interrupt due to corresponding pin
Bits clear: GPIO line interrupt not active
Bits set: GPIO line asserting interrupt</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IC</name>
          <addressOffset>0x41c</addressOffset>
          <size>32</size>
          <description>The IC register is the interrupt clear register. Writing 1 to a bit in this register clears the corresponding interrupt edge detection logic register. Writing 0 has no effect.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>IC</name>
              <description>[7:0] Bit written as 1: Clears edge detection logic
Bit written as 0: Has no effect</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AFSEL</name>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <description>The AFSEL register is the mode control select register. Writing 1 to any bit in this register selects the hardware (peripheral) control for the corresponding GPIO line. All bits are cleared by a reset, therefore no GPIO line is set to hardware control by default.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AFSEL</name>
              <description>[7:0] Bit set: Enables hardware (peripheral) control mode
Bit cleared: Enables software control mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIOLOCK</name>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <description>A write of the value 0x4C4F434B to the GPIOLOCK register unlocks the GPIO commit register (GPIOCR) for write access. A write of any other value reapplies the lock, preventing any register updates. Any write to the commit register (GPIOCR) causes the lock register to be locked.</description>
          <fields>
            <field>
              <name>LOCK</name>
              <description>[31:0] A read of this register returns the following values:
Locked: 0x00000001
Unlocked: 0x00000000</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIOCR</name>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <description>The GPIOCR register is the commit register. The value of the GPIOCR register determines which bits of the AFSEL register is committed when a write to the AFSEL register is performed. If a bit in the GPIOCR register is 0, the data being written to the corresponding bit in the AFSEL register is not committed and retains its previous value. If a bit in the GPIOCR register is set to 1, the data being written to the corresponding bit of the AFSEL register is committed to the register and will reflect the new value. The contents of the GPIOCR register can only be modified if the GPIOLOCK register is unlocked. Writes to the GPIOCR register will be ignored if the GPIOLOCK register is locked. Any write to the commit register causes the lock register to be locked.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved bits return an indeterminate value, and should never be changed.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CR</name>
              <description>[7:0] On a bit-wise basis, any bit set allows the corresponding GPIOAFSEL bit to be set to its alternate function.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PMUX</name>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <description>The PMUX register can be used to output external decouple control and clock_32k on I/O pins.  Decouple control can be output on specific PB pins and clock_32k can be output on a specific PA or PB pin. These features override the current setting of the selected pin when enabled. The pin is set to output, pull-up and -down disabled, and analog mode disabled.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CKOEN</name>
              <description>[7:7] Clock out enable
When this bit is set, the 32-kHz clock is routed to either PA[0] or PB[7] pins. PMUX.CKOPIN selects the pin to use. This overrides the current configuration setting for this pin. The pullup or pulldown is disabled and the direction is set to output for this pin.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>Reserved7</name>
              <description>[6:5] These are spare registers that are unused in the design.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>CKOPIN</name>
              <description>[4:4] Decouple control pin select
This control only has relevance when CKOEN is set. 
When 0, PA[0] becomes the 32-kHz clock output. When 1, PB[7] becomes the 32-kHz clock output.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DCEN</name>
              <description>[3:3] Decouple control enable
When this bit is set, the on-die digital regulator status is routed  to either PB[1] or PB[0] pins. PMUX.DCPIN selects the pin to use. This overrides the current configuration setting for this pin. The pullup or pulldown is disabled and the direction is set to output for this pin.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[2:1] These are spare registers that are unused in the design.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DCPIN</name>
              <description>[0:0] Decouple control pin select
This control has relevance only when DCEN is set. 
When 0, PB[1] becomes the on-die digital regulator status (1 indicates the on-die digital regulator is active); when 1, PB[0] becomes the on-die digital regulator status.

NOTE: PB[1] and PB[0] can also be controlled with other override features.

