pipex/cc2538/svd/cc2538sf53.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>STTEST</name>
      <baseAddress>0x40110000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>LPBKGPT</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>GPTIMER Internal loopback</description>
          <fields>
            <field>
              <name>Reserved1</name>
              <description>[31:22] Reserved</description>
              <bitWidth>10</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>LPBK32GPT3</name>
              <description>[21:20] GPTimer3 32-bit RTC loopback modes
00: Normal operation
01: GPT0 GPTimerA PWM connected to GPT3 capture
10: GPT0 capture connected to GPT3 PWM GPTimer A
11: Reserved, defaults to normal operation</description>
              <bitWidth>2</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>LPBK32GPT2</name>
              <description>[19:18] GPTimer2 32-bit RTC loopback modes
00: Normal operation
01: GPT0 Timer A PWM connected to GPT2 capture
10: GPT0 capture connected to GPT2 PWM Timer A
11: Reserved, defaults to normal operation</description>
              <bitWidth>2</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>LPBK32GPT1</name>
              <description>[17:16] GPTimer1 32-bit RTC loopback modes
00: Normal operation
01: GPT0 timerA PWM connected to GPT1 capture
10: GPT0 capture connected to GPT1 PWM Timer A
11: Reserved, defaults to normal operation</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[15:8] Reserved</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>LPBK16GPT3</name>
              <description>[7:6] GPTimer3 16-bit loopback modes
00: Normal operation
01: Timer A PWM connected to Timer B capture
10: Timer A capture connected to Timer B PWM
11: Reserved, defaults to normal operation</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>LPBK16GPT2</name>
              <description>[5:4] GPTimer2 16-bit loopback modes
00: Normal operation
01: Timer A PWM connected to Timer B capture
10: Timer A capture connected to Timer B PWM
11: Reserved, defaults to normal operation</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>LPBK16GPT1</name>
              <description>[3:2] GPTimer1 16-bit loopback modes
00: Normal operation
01: Timer A PWM connected to Timer B capture
10: Timer A capture connected to Timer B PWM
11: Reserved, defaults to normal operation</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>LPBK16GPT0</name>
              <description>[1:0] GPTimer0 16-bit loopback modes
00: Normal operation
01: Timer A PWM connected to Timer B capture
10: Timer A capture connected to Timer B PWM
11: Reserved, defaults to normal operation</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LPBKUART</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>UART internal loopback</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:1] Reserved</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>LPBKUART</name>
              <description>[0:0] UART0/1 loopback mode
0: Normal operation
1: UART0 TX (RX) connected to UART1 RX (TX)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LPBKI2C</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>I2C internal loopback</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:1] Reserved</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>LPBKI2C</name>
              <description>[0:0] I2C0 Master/slave loopback mode
0: Normal mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PTME1</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Peripheral test mode enable 1</description>
          <fields>
            <field>
              <name>Reserved1</name>
              <description>[31:10] Reserved</description>
              <bitWidth>22</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>UART1TME</name>
              <description>[9:9] UART1 test mode enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>UART0TME</name>
              <description>[8:8] UART0 test mode enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[7:0] Reserved</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PTME2</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Peripheral test mode enable 2</description>
          <fields>
            <field>
              <name>Reserved1</name>
              <description>[31:20] Reserved</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>T3TME</name>
              <description>[19:19] Timer3 test mode enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>MTTME</name>
              <description>[18:18] MacTimer test mode enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>T1TME</name>
              <description>[17:17] Timer1 test mode enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>T0TME</name>
              <description>[16:16] Timer0 test mode enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[15:1] Reserved</description>
              <bitWidth>15</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>I2C0TME</name>
              <description>[0:0] I2C 0 test mode enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT</name>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <description>GPTIMER override values</description>
          <fields>
            <field>
              <name>Reserved1</name>
              <description>[31:9] Reserved</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>GPTIDOE</name>
              <description>[8:8] GPTimer increment/decrement override enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[7:5] Reserved</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>GPTIDOV</name>
              <description>[4:0] GPTimer increment/decrement override value</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
