pipex/cc2538/svd/cc2538sf53.svd
Attention: Continuously reading this register to poll the run bit is not allowed when executing complex sequencer operations (the sequencer cannot access the PKCP when this is done). Leave at least one sysclk cycle between poll operations.</description>
          <fields>
            <field>
              <name>Reserved1</name>
              <description>[31:25] Set to zero on write, ignore on read</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>STALL_RESULT</name>
              <description>[24:24] When written with a 1b, updating of the PKA_COMPARE, PKA_MSW and PKA_DIVMSW registers, as well as resetting the run bit is stalled beyond the point that a running operation is actually finished. Use this to allow software enough time to read results from a previous operation when the newly started operation is known to take only a short amount of time. If a result is waiting, the result registers is updated and the run bit is reset in the clock cycle following writing the stall result bit back to 0b. The Stall result function may only be used for basic PKCP operations.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[23:16] Set to zero on write, ignore on read</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RUN</name>
              <description>[15:15] The host sets this bit to instruct the PKA module to begin processing the basic PKCP or complex sequencer operation. This bit is reset low automatically when the operation is complete. The complement of this bit is output as interrupts[1].
After a reset, the run bit is always set to 1b. Depending on the option, program ROM or program RAM, the following applies:
Program ROM - The first sequencer instruction sets the bit to 0b. This is done immediately after the hardware reset is released.
Program RAM - The sequencer must set the bit to 0b. As a valid firmware may not have been loaded, the sequencer is held in software reset after the hardware reset is released (the reset bit in PKA_SEQ_CRTL is set to 1b). After the FW image is loaded and the Reset bit is cleared, the sequencer starts to execute the FW. The first instruction clears the run bit.
In both cases a few clock cycles are needed before the first instruction is executed and the run bit state has been propagated.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>SEQUENCER_OPERATIONS</name>
              <description>[14:12] These bits select the complex sequencer operation to perform: 
000b: None 
001b: ExpMod-CRT 
010b: ExpMod-ACT4 (compatible with EIP2315) 
011b: ECC-ADD (if available in firmware, otherwise reserved) 
100b: ExpMod-ACT2 (compatible with EIP2316) 
101b: ECC-MUL (if available in firmware, otherwise reserved) 
110b: ExpMod-variable 
111b: ModInv (if available in firmware, otherwise reserved) 
The encoding of these operations is determined by sequencer firmware.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>COPY</name>
              <description>[11:11] Perform copy operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>COMPARE</name>
              <description>[10:10] Perform compare operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>MODULO</name>
              <description>[9:9] Perform modulo operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DIVIDE</name>
              <description>[8:8] Perform divide operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>LSHIFT</name>
              <description>[7:7] Perform left shift operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RSHIFT</name>
              <description>[6:6] Perform right shift operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SUBTRACT</name>
              <description>[5:5] Perform subtract operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>ADD</name>
              <description>[4:4] Perform add operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MS_ONE</name>
              <description>[3:3] Loads the location of the Most Significant one bit within the result word indicated in the PKA_MSW register into bits [4:0] of the PKA_DIVMSW register - can only be used with basic PKCP operations, except for Divide, Modulo and Compare.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[2:2] Set to zero on write, ignore on read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ADDSUB</name>
              <description>[1:1] Perform combined add/subtract operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MULTIPLY</name>
              <description>[0:0] Perform multiply operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>COMPARE</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>PKA compare result
This register provides the result of a basic PKCP compare operation. It is updated when the run bit in the PKA_FUNCTION register is reset at the end of that operation.
Status after a complex sequencer operation is unknown</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:3] Ignore on read</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>A_GREATER_THAN_B</name>
              <description>[2:2] Vector_A is greater than Vector_B</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>A_LESS_THAN_B</name>
              <description>[1:1] Vector_A is less than Vector_B</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>A_EQUALS_B</name>
              <description>[0:0] Vector_A is equal to Vector_B</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MSW</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>PKA most-significant-word of result vector
This register indicates the (word) address in the PKA RAM where the most significant nonzero 32-bit word of the result is stored. Should be ignored for modulo operations. For basic PKCP operations, this register is updated when the run bit in the PKA_FUNCTION register is reset at the end of the operation. For the complex-sequencer controlled operations, updating of the final value matching the actual result is done near the end of the operation; note that the result is only meaningful if no errors were detected and that for ECC operations, the PKA_MSW register will provide information for the x-coordinate of the result point only.</description>
          <fields>
            <field>
              <name>Reserved1</name>
              <description>[31:16] Ignore on read</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESULT_IS_ZERO</name>
              <description>[15:15] The result vector is all zeroes, ignore the address returned in bits [10:0]</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[14:11] Ignore on read</description>
              <bitWidth>4</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MSW_ADDRESS</name>
              <description>[10:0] Address of the most-significant nonzero 32-bit word of the result vector in PKA RAM</description>
              <bitWidth>11</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIVMSW</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>PKA most-significant-word of divide remainder
This register indicates the (32-bit word) address in the PKA RAM where the most significant nonzero 32-bit word of the remainder result for the basic divide and modulo operations is stored. Bits [4:0] are loaded with the bit number of the most-significant nonzero bit in the most-significant nonzero word when MS one control bit is set. For divide, modulo, and MS one reporting, this register is updated when the RUN bit in the PKA_FUNCTION register is reset at the end of the operation. For the complex sequencer controlled operations, updating of bits [4:0] of this register with the most-significant bit location of the actual result is done near the end of the operation. The result is meaningful only if no errors were detected and that for ECC operations; the PKA_DIVMSW register provides information for the x-coordinate of the result point only.</description>
          <fields>
            <field>
              <name>Reserved1</name>
              <description>[31:16] Ignore on read</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESULT_IS_ZERO</name>
              <description>[15:15] The result vector is all zeroes, ignore the address returned in bits [10:0]</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[14:11] Ignore on read</description>
              <bitWidth>4</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MSW_ADDRESS</name>
              <description>[10:0] Address of the most significant nonzero 32-bit word of the remainder result vector in PKA RAM</description>
              <bitWidth>11</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEQ_CTRL</name>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <description>PKA sequencer control and status register
The sequencer is interfaced with the outside world through a single control and status register. With the exception of bit [31], the actual use of bits in the separate sub-fields of this register is determined by the sequencer firmware. This register need only be accessed when the sequencer program is stored in RAM. The reset value of the RESTE bit depends upon the option chosen for sequencer program storage.</description>
          <fields>
            <field>
              <name>RESET</name>
              <description>[31:31] Option program ROM: Reset value = 0. Read/Write, reset value 0b (ZERO). Writing 1b resets the sequencer, write to 0b to restart operations again. As the reset value is 0b, the sequencer will automatically start operations executing from program ROM. This bit should always be written with zero and ignored when reading this register.

Option Program RAM: Reset value =1. Read/Write, reset value 1b (ONE). When 1b, the sequencer is held in a reset state and the PKA_PROGRAM area is accessible for loading the sequencer program (while the PKA_DATA_RAM is inaccessible), write to 0b to (re)start sequencer operations and disable PKA_PROGRAM area accessibility (also enables the PKA_DATA_RAM accesses). Resetting the sequencer (in order to load other firmware) should only be done when the PKA Engine is not performing any operations (i.e. the run bit in the PKA_FUNCTION register should be zero).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>Reserved</name>
              <description>[30:16] Set to zero on write, ignore on read</description>
              <bitWidth>15</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>SEQUENCER_STATUS</name>
              <description>[15:8] These read-only bits can be used by the sequencer to communicate status to the outside world. Bit [8] is also used as sequencer interrupt, with the complement of this bit ORed into the run bit in PKA_FUNCTION. This field should always be written with zeroes and ignored when reading this register.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SW_CONTROL_STATUS</name>
              <description>[7:0] These bits can be used by software to trigger sequencer operations. External logic can set these bits by writing 1b, cannot reset them by writing 0b. The sequencer can reset these bits by writing 0b, cannot set them by writing 1b. Setting the run bit in PKA_FUNCTION together with a nonzero sequencer operations field automatically sets bit [0] here. This field should always be written with zeroes and ignored when reading this register.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OPTIONS</name>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <description>PKA hardware options register
This register provides the host with a means to determine the hardware configuration implemented in this PKA engine, focused on options that have an effect on software interacting with the module.

Note: (32 x (1st LNME nr. of PEs + 1st LNME FIFO RAM depth - 10)) equals the maximum modulus vector length (in bits) that can be handled by the modular exponentiation and ECC operations executed on a PKA engine that includes an LNME.</description>
          <fields>
            <field>
              <name>FIRST_LNME_FIFO_DEPTH</name>
              <description>[31:24] Number of words in the first LNME's FIFO RAM
Should be ignored if LNME configuration is 0. The contents of this field indicate the actual depth as selected by the LNME FIFO RAM size strap input, fifo_size_sel.
Note: Reset value is undefined</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>Reserved1</name>
              <description>[23:22] Ignore on read</description>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>FIRST_LNME_NR_OF_PES</name>
              <description>[21:16] Number of processing elements in the pipeline of the first LNME
Should be ignored if LNME configuration is 0.
Note: Reset value is undefined.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[15:13] Ignore on read</description>
              <bitWidth>3</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>MMM3A</name>
              <description>[12:12] Reserved for a future functional extension to the LNME
Always 0b</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>INT_MASKING</name>
              <description>[11:11] Value 0b indicates that the main interrupt output (bit [1] of the interrupts output bus) is the direct complement of the run bit in the PKA_CONTROL register, value 1b indicates that interrupt masking logic is present for this output.
Note: Reset value is undefined</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PROTECTION_OPTION</name>
              <description>[10:8] Value 0 indicates no additional protection against side channel attacks, value 1 indicates the SCAP option, value 3 indicates the PROT option; other values are reserved.
Note: Reset value is undefined</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PROGRAM_RAM</name>
              <description>[7:7] Value 1b indicates sequencer program storage in RAM, value 0b in ROM.
Note: Reset value is undefined</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SEQUENCER_CONFIGURATION</name>
              <description>[6:5] Value 1 indicates a standard sequencer; other values are reserved.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>LNME_CONFIGURATION</name>
              <description>[4:2] Value 0 indicates NO LNME, value 1 indicates one standard LNME (with alpha = 32, beta = 8); other values reserved.
Note: Reset value is undefined</description>
              <bitWidth>3</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PKCP_CONFIGURATION</name>
              <description>[1:0] Value 1 indicates a PKCP with a 16x16 multiplier, value 2 indicates a PKCP with a 32x32 multiplier, other values reserved.
Note: Reset value is undefined.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SW_REV</name>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <description>PKA firmware revision and capabilities register
This register allows the host access to the internal firmware revision number of the PKA Engine for software driver matching and diagnostic purposes. This register also contains a field that encodes the capabilities of the embedded firmware.
The PKA_SW_REV register is written by the firmware within a few clock cycles after starting up that firmware. The hardware reset value is zero, indicating that the information has not been written yet.</description>
          <fields>
            <field>
              <name>FW_CAPABILITIES</name>
              <description>[31:28] 4-bit binary encoding for the functionality implemented in the firmware. Value 0 indicates basic ModExp with/without CRT. Value 1 adds Modular Inversion, value 2 adds Modular Inversion and ECC operations. Values 3-15 are reserved.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>MAJOR_FW_REVISION</name>
              <description>[27:24] 4-bit binary encoding of the major firmware revision number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>MINOR_FW_REVISION</name>
              <description>[23:20] 4-bit binary encoding of the minor firmware revision number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>FW_PATCH_LEVEL</name>
              <description>[19:16] 4-bit binary encoding of the firmware patch level, initial release will carry value zero
Patches are used to remove bugs without changing the functionality or interface of a module.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved</name>
              <description>[15:0] Ignore on read</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
