pipex/cc2538/svd/cc2538sf53.svd
        <register>
          <name>REVISION</name>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <description>PKA hardware revision register
This register allows the host access to the hardware revision number of the PKA engine for software driver matching and diagnostic purposes. It is always located at the highest address in the access space of the module and contains an encoding of the EIP number (with its complement as signature) for recognition of the hardware module.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:28] Ignore on read</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>MAJOR_HW_REVISION</name>
              <description>[27:24] 4-bit binary encoding of the major hardware revision number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>MINOR_HW_REVISION</name>
              <description>[23:20] 4-bit binary encoding of the minor hardware revision number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>HW_PATCH_LEVEL</name>
              <description>[19:16] 4-bit binary encoding of the hardware patch level, initial release will carry value zero
Patches are used to remove bugs without changing the functionality or interface of a module.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>COMPLEMENT_OF_BASIC_EIP_NUMBER</name>
              <description>[15:8] Bit-by-bit logic complement of bits [7:0], EIP-28 gives 0xE3</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASIC_EIP_NUMBER</name>
              <description>[7:0] 8-bit binary encoding of the EIP number, EIP-28 gives 0x1C</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CCTEST</name>
      <baseAddress>0x44010000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>IO</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Output strength control</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:1] Reserved (read zero)</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SC</name>
              <description>[0:0] I/O strength control bit
Common to all digital output pads
Should be set when unregulated voltage is below approximately 2.6 V.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OBSSEL0</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Select output signal on observation output 0</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved (read zero)</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[7:7] Observation output 0 enable control for PC0
0: Observation output disabled
1: Observation output enabled
Note: If enabled, this overwrites the standard GPIO behavior of PC0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SEL</name>
              <description>[6:0] n - obs_sigs[n] output on output 0:
0: rfc_obs_sig0
1: rfc_obs_sig1
2: rfc_obs_sig2
Others: Reserved</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OBSSEL1</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Select output signal on observation output 1</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved (read zero)</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[7:7] Observation output 1 enable control for PC1
0: Observation output disabled
1: Observation output enabled
Note: If enabled, this overwrites the standard GPIO behavior of PC1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SEL</name>
              <description>[6:0] n - obs_sigs[n] output on output 1:
0: rfc_obs_sig0
1: rfc_obs_sig1
2: rfc_obs_sig2
Others: Reserved</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OBSSEL2</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Select output signal on observation output 2</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved (read zero)</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[7:7] Observation output 2 enable control for PC2
0: Observation output disabled
1: Observation output enabled
Note: If enabled, this overwrites the standard GPIO behavior of PC2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SEL</name>
              <description>[6:0] n - obs_sigs[n] output on output 2:
0: rfc_obs_sig0
1: rfc_obs_sig1
2: rfc_obs_sig2
Others: Reserved</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OBSSEL3</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Select output signal on observation output 3</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved (read zero)</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[7:7] Observation output 3 enable control for PC3
0: Observation output disabled
1: Observation output enabled
Note: If enabled, this overwrites the standard GPIO behavior of PC3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SEL</name>
              <description>[6:0] n - obs_sigs[n] output on output 3:
0: rfc_obs_sig0
1: rfc_obs_sig1
2: rfc_obs_sig2
Others: Reserved</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OBSSEL4</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Select output signal on observation output 4</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved (read zero)</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[7:7] Observation output 4 enable control for PC4
0: Observation output disabled
1: Observation output enabled
Note: If enabled, this overwrites the standard GPIO behavior of PC4.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SEL</name>
              <description>[6:0] n - obs_sigs[n] output on output 4:
0: rfc_obs_sig0
1: rfc_obs_sig1
2: rfc_obs_sig2
Others: Reserved</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OBSSEL5</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Select output signal on observation output 5</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved (read zero)</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[7:7] Observation output 5 enable control for PC5
0: Observation output disabled
1: Observation output enabled
Note: If enabled, this overwrites the standard GPIO behavior of PC5.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SEL</name>
              <description>[6:0] n - obs_sigs[n] output on output 5:
0: rfc_obs_sig0
1: rfc_obs_sig1
2: rfc_obs_sig2
Others: Reserved</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OBSSEL6</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Select output signal on observation output 6</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved (read zero)</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[7:7] Observation output 6 enable control for PC6
0: Observation output disabled
1: Observation output enabled
Note: If enabled, this overwrites the standard GPIO behavior of PC6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SEL</name>
              <description>[6:0] n - obs_sigs[n] output on output 6:
0: rfc_obs_sig0
1: rfc_obs_sig1
2: rfc_obs_sig2
Others: Reserved</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OBSSEL7</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Select output signal on observation output 7</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved (read zero)</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[7:7] Observation output 7 enable control for PC7
0: Observation output disabled
1: Observation output enabled
Note: If enabled, this overwrites the standard GPIO behavior of PC7.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SEL</name>
              <description>[6:0] n - obs_sigs[n] output on output 7:
0: rfc_obs_sig0
1: rfc_obs_sig1
2: rfc_obs_sig2
Others: Reserved</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TR0</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Test register 0</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:3] Reserved (read zero)</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>Reserved2</name>
              <description>[2:2] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ADCTM</name>
              <description>[1:1] Set to 1 to connect the temperature sensor to the SOC_ADC. See also RFCORE_XREG_ATEST register description
to enable the temperature sensor.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>Reserved0</name>
              <description>[0:0] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>USBCTRL</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>USB PHY stand-by control</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:1] Reserved (read zero)</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>USB_STB</name>
              <description>[0:0] USB PHY stand-by override bit
When this bit is cleared to 0 (default state) the USB module cannot change the stand-by mode of the PHY (USB pads) and the PHY is forced out of stand-by mode. This bit must be 1 as well as the stand-by control from the USB controller, before the mode of the PHY is stand-by.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
